<?php

/**
 * The template for displaying product content in the single-product.php template
 *
 * This template can be overridden by copying it to yourtheme/woocommerce/content-single-product.php.
 *
 * HOWEVER, on occasion WooCommerce will need to update template files and you
 * (the theme developer) will need to copy the new files to your theme to
 * maintain compatibility. We try to do this as little as possible, but it does
 * happen. When this occurs the version of the template file will be bumped and
 * the readme will list any important changes.
 *
 * @see     https://docs.woocommerce.com/document/template-structure/
 * @package WooCommerce\Templates
 * @version 3.6.0
 */

defined('ABSPATH') || exit;

global $product;



/**
 * Hook: woocommerce_before_single_product.
 *
 * @hooked woocommerce_output_all_notices - 10
 */
do_action('woocommerce_before_single_product');

if (post_password_required()) {
    echo get_the_password_form(); // WPCS: XSS ok.
    return;
}

$ucenennyj_value = $product->get_attribute('pa_ucenennyj');
$ucenenn = '';
if ('да' === strtolower($ucenennyj_value)) {
    $ucenenn = "уцененный";
}

?>



<div class="container xl:mt-6">
    <div id="product-<?php the_ID(); ?>" <?php wc_product_class('xl:grid grid-cols-1 xl:grid-cols-7 xl:gap-3', $product); ?>>
        <?php if (defined('NITISVETA_STORE_CLOSED') && NITISVETA_STORE_CLOSED): ?>
            <div class="mb-3" style="grid-column:1/-1">
                <?php get_template_part('template-parts/blocks/store-closed-banner'); ?>
            </div>
        <?php endif; ?>

        <div class="single-product-gallery-wrapper w-full col-span-4 xl:col-span-3 px-0">

            <?php $attachment_ids = $product->get_gallery_image_ids(); ?>

            <div class="swiper mySwiper2 select-none swiper-product bg-white shadow mb-3">
                <div class="swiper-wrapper">

                    <div class="swiper-slide h-[340px] xl:h-[560px] w-full">
                        <img src="<?php echo get_the_post_thumbnail_url($product->ID); ?>" class="object-contain h-full w-full" />
                    </div>

                    <?php foreach ($attachment_ids as $attachment_id) { ?>
                        <div class="swiper-slide h-[340px] xl:h-[560px] w-full">
                            <img src="<?php echo wp_get_attachment_url($attachment_id); ?>" class='object-contain h-full w-full block' />
                        </div>
                    <?php } ?>

                </div>
                <div class="swiper-navigation xl:hidden absolute h-0 top-1/2 px-1 w-full flex items-center justify-between gap-5 z-10">
                    <div class="swiper-sprod-button-prev h-4 w-4 block"><svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M2 6.76795C0.666667 7.53775 0.666665 9.46225 2 10.2321L10.25 14.9952C11.5833 15.765 13.25 14.8027 13.25 13.2631L13.25 3.73686C13.25 2.19726 11.5833 1.23501 10.25 2.00481L2 6.76795Z" fill="#EF3343" stroke="white" stroke-width="2" />
                        </svg>
                    </div>
                    <div class="swiper-sprod-button-next h-4 w-4 block"><svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13 10.2321C14.3333 9.46225 14.3333 7.53775 13 6.76795L4.75 2.00481C3.41667 1.23501 1.75 2.19726 1.75 3.73686L1.75 13.2631C1.75 14.8027 3.41666 15.765 4.75 14.9952L13 10.2321Z" fill="#EF3343" stroke="white" stroke-width="2" />
                        </svg>
                    </div>
                </div>
                <div class="swiper-pagination xl:hidden"></div>
            </div>

            <div thumbsSlider="" class="swiper select-none mySwiper swiper-thumbs relative max-lg:hidden">
                <div class="swiper-wrapper">
                    <div class="swiper-slide h-52 card">
                        <!-- <img src="<?php echo get_the_post_thumbnail_url($product->ID); ?>" class='object-cover object-center h-full w-full block border-2 border-transparent hover:border-secondary transition cursor-pointer' /> -->
                        <img src="<?php echo get_the_post_thumbnail_url($product->ID); ?>" class='object-contain h-full w-full block border-2 border-transparent hover:border-secondary transition cursor-pointer' />
                    </div>

                    <?php foreach ($attachment_ids as $attachment_id) { ?>
                        <div class="swiper-slide h-52 card">
                            <!-- <img src="<?php echo wp_get_attachment_url($attachment_id); ?>" class='object-cover object-center h-full w-full block border-2 border-transparent hover:border-secondary transition cursor-pointer' /> -->
                            <img src="<?php echo wp_get_attachment_url($attachment_id); ?>" class='object-contain h-full w-full block border-2 border-transparent hover:border-secondary transition cursor-pointer' />
                        </div>
                    <?php } ?>
                </div>

                <div class="swiper-navigation absolute h-0 top-1/2 px-1 w-full flex items-center justify-between gap-5 z-10">
                    <div class="swiper-thumb-button-prev h-4 w-4 block"><svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M2 6.76795C0.666667 7.53775 0.666665 9.46225 2 10.2321L10.25 14.9952C11.5833 15.765 13.25 14.8027 13.25 13.2631L13.25 3.73686C13.25 2.19726 11.5833 1.23501 10.25 2.00481L2 6.76795Z" fill="#EF3343" stroke="white" stroke-width="2" />
                        </svg>
                    </div>
                    <div class="swiper-thumb-button-next h-4 w-4 block"><svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13 10.2321C14.3333 9.46225 14.3333 7.53775 13 6.76795L4.75 2.00481C3.41667 1.23501 1.75 2.19726 1.75 3.73686L1.75 13.2631C1.75 14.8027 3.41666 15.765 4.75 14.9952L13 10.2321Z" fill="#EF3343" stroke="white" stroke-width="2" />
                        </svg>
                    </div>
                </div>


            </div>

            <?php if (get_field('video')) : ?>
                <video controls>
                    <source src="<?php the_field('video'); ?>#t=2.0">
                    Ваш браузер не поддерживает видео
                </video>
            <?php endif; ?>

        </div>

        <div class="col-span-4 bg-white shadow xl:p-9 flex flex-col relative product-summary">

            <?php if ($ucenenn) : ?>
                <div class="bg-primary text-white flex items-center absolute top-0 right-9 h-9 px-8 font-title text-xl rounded-b-lg max-xl:hidden">
                    уцененный</div>
            <?php endif; ?>

            <h1 class="text-base xl:text-xl font-bold max-xl:mt-2 mb-4 xl:mb-9">
                <?php the_title(); ?>
            </h1>

            <p>
                <!-- Output only the product description with paragraphs -->
                <?php echo wpautop($product->get_description()); ?>
            </p>



            <div class="grid grid-cols-1 xl:grid-cols-3 gap-x-4 text-sm leading-6 pb-7 border-b-2 xl:border-b border-slate-200">

                <?php if ($product->get_height()) : ?>
                    <div>
                        Высота:
                        <?php echo $product->get_height(); ?> см
                    </div>
                <?php endif; ?>

                <?php if ($product->get_length()) : ?>
                    <div>
                        Длина:
                        <?php echo $product->get_length(); ?> см
                    </div>
                <?php endif; ?>

                <?php if ($product->get_width()) : ?>
                    <div>
                        Ширина:
                        <?php echo $product->get_width(); ?> см
                    </div>
                <?php endif; ?>

                <?php if ($product->get_weight()) : ?>
                    <div>
                        Вес:
                        <?php echo $product->get_weight(); ?> кг
                    </div>
                <?php endif; ?>

                <?php

                $attributes = $product->get_attributes();

                foreach ($attributes as $attribute) {
                    if ($attribute->is_taxonomy()) {
                        $taxonomy = $attribute->get_name();
                        $terms = wc_get_product_terms(get_the_ID(), $taxonomy, array('fields' => 'names'));
                        $value = implode(', ', $terms);
                        $label = wc_attribute_label($taxonomy);
                    } else {
                        $value = $attribute->get_options();
                        $value = implode(', ', $value);
                        $label = $attribute->get_name();
                    }

                    echo '<div>' . $label . ': ' . $value . '</div>';
                }
                ?>


            </div>

            <div class="pb-5 pt-3 xl:pb-7 xl:pt-7 mb-6 xl:mb-8 border-b-2 xl:border-b  border-slate-200 flex xl:items-center flex-col xl:flex-row xl:gap-8 gap-4 relative">

                <?php if ($ucenenn) : ?>
                    <div class="absolute flex items-center justify-center top-1/2 z-20 -right-[60px] -mt-3 rotate-90 w-[120px] xl:hidden">
                        <div class="bg-primary text-white flex justify-center items-center h-6 xl:h-9 w-full text-center font-title text-sm xl:text-xl rounded-b-lg z-10">уцененный</div>
                    </div>

                <?php endif; ?>

                <?php
                $product = wc_get_product(get_the_ID());
                $thePrice = $product->get_price(); //will give raw price
                $regularPrice = $product->get_regular_price(); //will give raw price
                $discountValue = $regularPrice - $thePrice; //will give raw price

                $percent = (($regularPrice - $thePrice) / $regularPrice) * 100;

                if ($regularPrice != $thePrice) { ?>
                    <div class='flex items-center gap-3 max-xl:order-2'>
                        <span class='text-lg xl:text-xl font-bold'>
                            <?php echo $thePrice; ?> ₽
                        </span>
                        <span class='opacity-50 text-lg xl:text-xl font-bold relative xl:top-1/2 inline-block'>
                            <?php echo $regularPrice ?> ₽ <span class="absolute h-[2px] w-full bg-primary top-1/2 left-0"></span>
                        </span>
                        <span class='rounded-md border border-[#E6E2EB] text-sm w-16 h-8 font-bold inline-flex items-center justify-center'>-
                            <?php echo round($percent) ?> %
                        </span>
                    </div>
                <?php } else { ?>
                    <div class='product-price-wrapper'>
                        <span class='sale-price text-lg xl:text-xl font-bold max-xl:order-2'>
                            <?php echo $thePrice ?> ₽
                        </span>
                    </div>
                <?php } ?>


                <?php if ($ucenenn) : ?>
                    <div class="text-secondary text-sm ucen-link cursor-pointer max-xl:order-3">Почему товар уцененный?</div>
                <?php endif; ?>
            </div>

            <!-- <?php
                    if ($product->is_in_stock()) { ?>
                <div class="pt-1 xl:pt-7">
                    <form class="w-full mb-4" action="<?php echo esc_url(get_permalink()); ?>" method="post" enctype='multipart/form-data'>
                        <?php
                        $product_id = esc_attr($product->get_id());
                        $quantity = get_product_quantity_in_cart($product_id);
                        ?>

                        <input type="hidden" name="add-to-cart" value="<?php echo esc_attr($product->get_id()); ?>" />
                        <input type="hidden" name="quantity" value="1" />

                        <div class="grid sm:grid-cols-3 grid-cols-1 gap-5">
                            <div class="grid grid-cols-3">
                                <button type="submit" class="text-[35px] text-white rounded-l-lg bg-secondary w-full decrement-quantity">
                                    -
                                </button>
                                <p class="flex justify-center items-center text-[25px] max-h-[50px] border-b border-t border-[#B6B6] product-quantity"><?php echo $quantity; ?></p>
                                <button type="submit" class="text-[35px] text-white rounded-r-lg bg-secondary w-full increment-quantity">
                                    +
                                </button>
                            </div>

                            <div class="">
                                <?php echo do_shortcode('[yith_wcwl_add_to_wishlist]'); ?>
                            </div>

                            <div class="">
                                <div class="btn-border share-link cursor-pointer h-[50px]" data-template="share"><span>Поделиться</span></div>
                            </div>
                        </div>
                    </form>
                </div>
            <?php  }
            ?> -->

            <?php
            if ($product->is_in_stock()) { ?>
                <div class="pt-1 xl:pt-7 max-w-lg">
                    <form class="w-full mb-4" action="<?php echo esc_url(get_permalink()); ?>" method="post" enctype='multipart/form-data'>
                        <?php
                        $product_id = esc_attr($product->get_id());
                        $quantity = get_product_quantity_in_cart($product_id);
                        ?>

                        <input type="hidden" name="add-to-cart" value="<?php echo esc_attr($product->get_id()); ?>" />
                        <input type="hidden" name="quantity" value="1" />
                        <button type="submit" class="btn bg-secondary w-full">
                            <?php if ($quantity > 0) : ?>
                                <?php echo $quantity; ?> уже в корзине. Добавить еще?
                            <?php else : ?>
                                <?php echo esc_html($product->single_add_to_cart_text()); ?>
                            <?php endif; ?>
                        </button>
                    </form>
                </div>
            <?php  }
            ?>

            <div class="grid grid-cols-1 xl:grid-cols-2 gap-6 xl:gap-12 max-w-lg mt-2 xl:mt-5 xl:mb-10">

                <div class="">
                    <?php echo do_shortcode('[yith_wcwl_add_to_wishlist]'); ?>
                </div>

                <div class="">
                    <div class="btn-border share-link cursor-pointer h-[50px]" data-template="share"><span>Поделиться</span></div>
                </div>

            </div>

            <div style="display: none;">
                <div id="share">
                    <div class="copy-link flex items-center gap-2 py-1 px-2 rounded hover:bg-white hover:bg-opacity-5 cursor-pointer" data-clipboard-text="<?php echo esc_url(get_permalink()); ?>">
                        <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M13.3525 10.6075C13.3525 12.1235 12.1235 13.3525 10.6075 13.3525H3.745C2.22898 13.3525 1 12.1235 1 10.6075V3.745C1 2.22898 2.22898 1 3.745 1H10.6075C12.1235 1 13.3525 2.22898 13.3525 3.745V10.6075Z" stroke="white" stroke-width="1.40625" stroke-linecap="round" stroke-linejoin="round" />
                            <path d="M6.39258 16.0001H13.2551C14.7711 16.0001 16.0001 14.7711 16.0001 13.2551V6.39258" stroke="white" stroke-width="1.40625" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>

                        <span>Скопировать ссылку</span>
                    </div>
                    <a class="flex items-center gap-2 py-1 px-2 rounded hover:bg-white hover:bg-opacity-5" target="_blank" href="https://t.me/share/url?url=<?php echo get_permalink(); ?>">
                        <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0.919431 5.32028L9.85562 1.69424C10.7374 1.31653 13.728 0.107851 13.728 0.107851C13.728 0.107851 15.1082 -0.420947 14.9932 0.863276C14.9549 1.39207 14.6481 3.24286 14.3414 5.24765L13.3829 11.1806C13.3829 11.1806 13.3062 12.0494 12.6544 12.2005C12.0027 12.3515 10.9291 11.6717 10.7374 11.5206C10.5841 11.4073 7.86193 9.70756 6.86509 8.87659C6.59671 8.64997 6.28999 8.19671 6.90343 7.66791C8.28368 6.42146 9.9323 4.87284 10.9291 3.89079C11.3892 3.43753 11.8493 2.37994 9.9323 3.66416L4.5234 7.24662C4.5234 7.24662 3.90996 7.62433 2.75976 7.28439C1.60955 6.94445 0.26765 6.49119 0.26765 6.49119C0.26765 6.49119 -0.652512 5.92462 0.919431 5.32028Z" fill="white" />
                        </svg>

                        <span>
                            Telegram
                        </span>
                    </a>
                    <a class="flex items-center gap-2 py-1 px-2 rounded hover:bg-white hover:bg-opacity-5" target="_blank" href="https://wa.me/?text=<?php echo get_permalink(); ?>">
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0.361625 8.04636C0.361099 9.42399 0.72093 10.7688 1.40519 11.9542L0.295898 16.0044L4.44106 14.9175C5.58312 15.5403 6.86891 15.8685 8.17748 15.8691H8.18081C12.49 15.8691 15.9981 12.3621 16 8.0525C16.0007 5.9638 15.188 3.99988 13.7118 2.52235C12.2354 1.04499 10.2723 0.230857 8.18081 0.22998C3.87072 0.22998 0.363202 3.73628 0.36145 8.04619L0.361625 8.04636ZM2.82979 11.75L2.67503 11.5043C2.02442 10.4698 1.68106 9.27431 1.68142 8.04689C1.68299 4.4647 4.59827 1.55012 8.18309 1.55012C9.91915 1.55082 11.5506 2.22754 12.7778 3.45549C14.0049 4.68344 14.6802 6.31591 14.6797 8.0518C14.6781 11.6342 11.7626 14.5487 8.18064 14.5487H8.17801C7.01158 14.548 5.86776 14.235 4.87029 13.6429L4.6328 13.5022L2.17287 14.1472L2.82979 11.75ZM8.18081 15.8691C8.18064 15.8691 8.18064 15.8691 8.18081 15.8691Z" fill="white" />
                            <path d="M6.22678 4.77817C6.08043 4.45287 5.92636 4.44621 5.7872 4.4406C5.67327 4.43569 5.54287 4.43604 5.41282 4.43604C5.28242 4.43604 5.07087 4.48494 4.89192 4.68037C4.71279 4.87597 4.20801 5.3485 4.20801 6.30969C4.20801 7.27105 4.90822 8.19981 5.00567 8.33039C5.10347 8.46061 6.35736 10.4962 8.343 11.2793C9.99335 11.9301 10.3293 11.8008 10.6874 11.7682C11.0457 11.7356 11.8433 11.2956 12.0062 10.8394C12.169 10.3832 12.169 9.99213 12.1203 9.91063C12.0714 9.82913 11.9411 9.78023 11.7457 9.6826C11.5503 9.5848 10.5898 9.11227 10.4107 9.04707C10.2315 8.98187 10.1013 8.94944 9.97092 9.14505C9.84069 9.34047 9.46649 9.7804 9.35256 9.91063C9.23864 10.0412 9.12453 10.0575 8.92928 9.95971C8.73386 9.86173 8.10463 9.65561 7.35815 8.99011C6.77731 8.47218 6.38522 7.83279 6.2713 7.63719C6.15737 7.44176 6.2592 7.33607 6.35701 7.23862C6.44482 7.15116 6.55243 7.0106 6.65023 6.89649C6.74768 6.78239 6.78029 6.70089 6.84531 6.57067C6.91051 6.44026 6.87791 6.32616 6.82901 6.22836C6.78011 6.13056 6.40047 5.16447 6.22678 4.77817Z" fill="white" />
                        </svg>

                        <span>WhatsApp</span>

                    </a>
                    <a class="flex items-center gap-2 py-1 px-2 rounded hover:bg-white hover:bg-opacity-5" target="_blank" href="https://vk.com/share.php?image=<?php echo get_the_post_thumbnail_url($product->ID); ?>&title=<?php echo get_the_title(); ?>&url=<?php echo get_permalink(); ?>">
                        <svg width="15" height="9" viewBox="0 0 15 9" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M7.33907 8.67315H8.23564C8.23564 8.67315 8.50639 8.64278 8.64483 8.49118C8.77208 8.35183 8.76801 8.09034 8.76801 8.09034C8.76801 8.09034 8.75047 6.86591 9.30873 6.6856C9.85927 6.50787 10.5661 7.86896 11.3151 8.39236C11.8816 8.78831 12.3121 8.70164 12.3121 8.70164L14.3153 8.67315C14.3153 8.67315 15.3632 8.60735 14.8663 7.76881C14.8256 7.70032 14.5768 7.14853 13.3768 6.01484C12.1206 4.82826 12.289 5.02023 13.8021 2.96774C14.7235 1.71778 15.0918 0.95471 14.9767 0.627905C14.8671 0.316528 14.1893 0.398781 14.1893 0.398781L11.9339 0.412973C11.9339 0.412973 11.7665 0.389804 11.6426 0.465282C11.5214 0.539094 11.4436 0.711555 11.4436 0.711555C11.4436 0.711555 11.0865 1.67875 10.6106 2.50143C9.60626 4.23712 9.20462 4.32899 9.04045 4.22104C8.65851 3.96982 8.75396 3.21203 8.75396 2.67352C8.75396 0.991374 9.00464 0.290025 8.2658 0.108479C8.02066 0.0482679 7.84007 0.00843181 7.21304 0.00192692C6.40822 -0.00640584 5.72722 0.00445387 5.34153 0.196752C5.08493 0.324647 4.88696 0.609573 5.0076 0.625969C5.15671 0.646183 5.49423 0.718705 5.67318 0.966537C5.90437 1.28668 5.89629 2.00534 5.89629 2.00534C5.89629 2.00534 6.02914 3.98547 5.58613 4.23136C5.28216 4.40006 4.86509 4.05568 3.96969 2.48095C3.511 1.67434 3.16455 0.782625 3.16455 0.782625C3.16455 0.782625 3.09784 0.616024 2.97868 0.526837C2.83416 0.41878 2.63223 0.384535 2.63223 0.384535L0.488906 0.398781C0.488906 0.398781 0.167232 0.40792 0.0490209 0.55033C-0.0561436 0.677095 0.0406232 0.938958 0.0406232 0.938958C0.0406232 0.938958 1.7185 4.93449 3.61854 6.948C5.36091 8.79433 7.33907 8.67315 7.33907 8.67315Z" fill="white" />
                        </svg>

                        <span>VK</span>

                    </a>
                </div>
            </div>

            <div class="mt-auto pt-5 max-xl:mt-7 xl:pt-7 border-t border-slate-200 text-sm max-xl:border-t-2">
                Доставка до двери или до пункта выдачи заказов по России, в Беларусь, Армению, Казахстан, Киргизию, <a href="/delivery" class="text-secondary"><span>другие страны</span> <svg class="inline-block" width="10" height="8" viewBox="0 0 10 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.35355 4.35355C9.54882 4.15829 9.54882 3.84171 9.35355 3.64645L6.17157 0.464466C5.97631 0.269204 5.65973 0.269204 5.46447 0.464466C5.2692 0.659728 5.2692 0.976311 5.46447 1.17157L8.29289 4L5.46447 6.82843C5.2692 7.02369 5.2692 7.34027 5.46447 7.53553C5.65973 7.7308 5.97631 7.7308 6.17157 7.53553L9.35355 4.35355ZM0 4.5H9V3.5H0V4.5Z" fill="#EF3343" />
                    </svg>
                </a>
            </div>

        </div>

    </div>


    <!-- ----------------------- -->
    <!-- <div class="mt-10 grid xl:grid-cols-7 grid-cols-1 gap-10">
        <div class="xl:col-span-3">
            <p class="font-semibold sm:text-[20px] text-[18px]">Как правильно заварить чай Лун Цзин</p>

            <div class="sm:mt-20 mt-5 grid grid-cols-1 md:gap-20 gap-10 items-center max-w-[800px]">

                    <div class="grid grid-cols-1 gap-5 items-center">
                        <div class="grid grid-cols-5 justify-items-center items-center gap-5 max-w-[500px]">

                            <div>
                                <svg width="50" height="43" viewBox="0 0 50 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M25 14.9998C25.6903 14.9998 26.25 13.8805 26.25 12.4998C26.25 11.1191 25.6903 9.99982 25 9.99982C24.3096 9.99982 23.75 11.1191 23.75 12.4998C23.75 13.8805 24.3096 14.9998 25 14.9998Z" fill="#3B2F4A"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M25.6155 14.1334C25.8168 13.7308 25.95 13.1537 25.95 12.4998C25.95 11.8459 25.8168 11.2688 25.6155 10.8662C25.4053 10.4457 25.1703 10.2998 25 10.2998C24.8297 10.2998 24.5947 10.4457 24.3844 10.8662C24.1832 11.2688 24.05 11.8459 24.05 12.4998C24.05 13.1537 24.1832 13.7308 24.3844 14.1334C24.5947 14.5539 24.8297 14.6998 25 14.6998C25.1703 14.6998 25.4053 14.5539 25.6155 14.1334ZM26.25 12.4998C26.25 13.8805 25.6903 14.9998 25 14.9998C24.3096 14.9998 23.75 13.8805 23.75 12.4998C23.75 11.1191 24.3096 9.99982 25 9.99982C25.6903 9.99982 26.25 11.1191 26.25 12.4998Z" fill="white"/>
                                    <path d="M47.5 29.9998H42.3692C42.4234 29.5857 42.5001 29.1757 42.5001 28.7498C42.5001 25.6057 41.135 22.714 38.8668 20.3949C39.4576 17.8907 40.0001 14.9574 40.0001 12.4999C40.0001 4.67243 34.3926 0 25.0002 0C15.6077 0 10.0003 4.67243 10.0003 12.4999C10.0003 15.3582 10.4819 18.1707 11.0352 20.4982C10.4711 21.0857 9.95856 21.7041 9.51852 22.359C8.15691 21.3916 6.88104 20.664 6.166 20.2874C5.80605 20.099 5.40605 19.9999 5.00019 19.9999H2.50021C1.43605 19.9999 0.488596 20.674 0.138598 21.6791C-0.210521 22.684 0.114478 23.8007 0.949434 24.4607C0.950312 24.4666 2.50021 25.934 2.50021 29.9998C2.50021 37.5132 8.76599 37.5132 10.8252 37.5132L11.5202 37.5073C14.7327 40.5547 19.5826 42.4997 25.0001 42.4997C28.3151 42.4997 31.3967 41.7464 34.0408 40.4823C35.71 41.7323 37.7592 42.4997 40 42.4997C45.5141 42.4997 49.9999 38.0139 49.9999 32.4998C50 31.119 48.8809 29.9998 47.5 29.9998ZM5.00029 29.9998C5.00029 24.4774 2.5003 22.4999 2.5003 22.4999H5.00029C5.00029 22.4999 6.59608 23.349 8.31609 24.6057C7.78855 25.9149 7.50027 27.3057 7.50027 28.7498C7.50027 30.984 8.19695 33.089 9.40524 34.9564C7.01278 34.7689 5.00029 33.8881 5.00029 29.9998ZM25.0002 2.49989C33.2843 2.49989 37.5001 6.28649 37.5001 12.4998C37.5001 14.3432 37.1501 16.5298 36.7159 18.5656C33.6101 16.3573 29.5084 14.9998 25.0002 14.9998C20.4436 14.9998 16.3011 16.3864 13.1835 18.6373C12.7977 16.749 12.5002 14.6274 12.5002 12.4998C12.5002 6.28658 16.716 2.49989 25.0002 2.49989ZM32.5726 19.0499C30.4292 19.6182 27.8826 19.9999 25.0002 19.9999C22.1169 19.9999 19.5419 19.6315 17.3986 19.0633C19.6294 18.0766 22.2219 17.5 25.0002 17.5C27.766 17.4999 30.3485 18.0707 32.5726 19.0499ZM25.0002 39.9997C16.716 39.9997 10.0003 34.9631 10.0003 28.7497C10.0003 25.6314 11.6936 22.8097 14.4269 20.7722C17.2302 21.8555 20.8827 22.4998 25.0002 22.4998C29.1209 22.4998 32.7443 21.8398 35.5484 20.7548C38.2959 22.7939 40.0001 25.6214 40.0001 28.7497C40.0001 29.1739 39.9551 29.5889 39.8901 29.9997H32.5001C31.1193 29.9997 30.0001 31.1189 30.0001 32.4997C30.0001 34.8164 30.8243 36.9238 32.1518 38.6214C30.0251 39.4939 27.5952 39.9997 25.0002 39.9997ZM40.0001 39.9997C35.8576 39.9997 32.5001 36.6422 32.5001 32.4997H47.5C47.5 36.6423 44.1425 39.9997 40.0001 39.9997Z" fill="#3B2F4A"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M42.0274 30.2998L42.0717 29.9609C42.0851 29.8588 42.0993 29.7599 42.1131 29.6633C42.1583 29.3479 42.2001 29.056 42.2001 28.7498C42.2001 25.697 40.8755 22.8777 38.6523 20.6047L38.5369 20.4867L38.5748 20.326C39.1643 17.8272 39.7001 14.9215 39.7001 12.4999C39.7001 8.66339 38.3292 5.62751 35.8302 3.54512C33.3242 1.45681 29.6503 0.3 25.0002 0.3C20.3501 0.3 16.6761 1.45681 14.1701 3.54512C11.6712 5.62751 10.3003 8.66339 10.3003 12.4999C10.3003 15.3266 10.7769 18.1143 11.3271 20.4288L11.3649 20.588L11.2516 20.706C10.6973 21.2833 10.1963 21.8882 9.76754 22.5263L9.5958 22.782L9.34476 22.6036C7.99648 21.6456 6.73262 20.925 6.02653 20.553C5.70922 20.387 5.35705 20.2999 5.00019 20.2999H2.50021C1.56387 20.2999 0.729982 20.8931 0.421912 21.7777C0.114781 22.6621 0.400872 23.6447 1.13546 24.2253L1.22852 24.2989L1.23245 24.3251C1.23564 24.3287 1.23892 24.3324 1.24229 24.3363C1.29056 24.3916 1.35705 24.4726 1.43555 24.5816C1.59259 24.7996 1.79694 25.1287 1.99949 25.5864C2.40501 26.5028 2.80021 27.9277 2.80021 29.9998C2.80021 31.8361 3.18278 33.19 3.77019 34.1917C4.35697 35.1923 5.15886 35.8598 6.02784 36.3073C7.77857 37.2088 9.78952 37.2132 10.824 37.2132C10.8244 37.2132 10.8248 37.2132 10.8252 37.2132L11.6388 37.2063L11.7266 37.2896C14.878 40.2791 19.6517 42.1997 25.0001 42.1997C28.2696 42.1997 31.3071 41.4568 33.9114 40.2116L34.0753 40.1333L34.2207 40.2422C35.8425 41.4567 37.8295 42.1997 40 42.1997C45.3484 42.1997 49.6999 37.8483 49.6999 32.4998C49.7 31.2846 48.7152 30.2998 47.5 30.2998H42.0274ZM10.8252 37.5132C8.76599 37.5132 2.50021 37.5132 2.50021 29.9998C2.50021 26.0711 1.05303 24.5684 0.954683 24.4663C0.951253 24.4628 0.949463 24.4609 0.949434 24.4607C0.114478 23.8007 -0.210521 22.684 0.138598 21.6791C0.488596 20.674 1.43605 19.9999 2.50021 19.9999H5.00019C5.40605 19.9999 5.80605 20.099 6.166 20.2874C6.83788 20.6413 8.00494 21.305 9.27302 22.1865C9.35447 22.2431 9.43634 22.3007 9.51852 22.359C9.5742 22.2762 9.63105 22.1939 9.689 22.1122C10.0891 21.5481 10.5424 21.0114 11.0352 20.4982C10.4819 18.1707 10.0003 15.3582 10.0003 12.4999C10.0003 4.67243 15.6077 0 25.0002 0C34.3926 0 40.0001 4.67243 40.0001 12.4999C40.0001 14.9574 39.4576 17.8907 38.8668 20.3949C41.135 22.714 42.5001 25.6057 42.5001 28.7498C42.5001 29.0727 42.456 29.3865 42.4111 29.6998C42.4101 29.7063 42.4092 29.7128 42.4083 29.7193C42.3949 29.8128 42.3815 29.9062 42.3692 29.9998H47.5C48.8809 29.9998 50 31.119 49.9999 32.4998C49.9999 38.0139 45.5141 42.4997 40 42.4997C37.7592 42.4997 35.71 41.7323 34.0408 40.4823C31.3967 41.7464 28.3151 42.4997 25.0001 42.4997C19.5826 42.4997 14.7327 40.5547 11.5202 37.5073L10.8252 37.5132ZM1.63748 22.1999H5.07513L5.14121 22.235L5.00029 22.4999H2.5003C2.5003 22.4999 2.61982 22.5944 2.80659 22.7999C3.47402 23.5341 5.00029 25.6849 5.00029 29.9998C5.00029 33.6813 6.8044 34.6667 9.02698 34.9203C9.15183 34.9345 9.278 34.9465 9.40524 34.9564C9.33696 34.8509 9.27031 34.7446 9.20533 34.6376C8.12044 32.8506 7.50027 30.8577 7.50027 28.7498C7.50027 27.3057 7.78855 25.9149 8.31609 24.6057C6.59608 23.349 5.00029 22.4999 5.00029 22.4999L5.14121 22.235L5.14654 22.2379L5.16097 22.2456L5.21604 22.2755C5.26405 22.3018 5.33418 22.3404 5.42355 22.3907C5.60227 22.4912 5.85805 22.6381 6.16784 22.8245C6.78703 23.197 7.62388 23.7284 8.49308 24.3635L8.68163 24.5012L8.59435 24.7178C8.08034 25.9934 7.80027 27.3463 7.80027 28.7498C7.80027 30.9196 8.47646 32.9687 9.65712 34.7935L9.98675 35.3029L9.3818 35.2555C8.16502 35.1602 6.98085 34.8857 6.10372 34.0878C5.21739 33.2816 4.70029 31.9939 4.70029 29.9998C4.70029 27.2858 4.08647 25.4591 3.48496 24.3189C3.18376 23.748 2.88439 23.3468 2.66377 23.0911C2.55343 22.9632 2.46271 22.8716 2.40124 22.8133C2.3705 22.7841 2.34707 22.7633 2.33216 22.7504L2.31633 22.7369L2.31419 22.7352L2.31339 22.7345L1.63748 22.1999ZM36.9141 19.0746L36.5421 18.8101C33.4895 16.6397 29.4492 15.2998 25.0002 15.2998C20.5033 15.2998 16.423 16.6684 13.3592 18.8805L12.9826 19.1524L12.8896 18.6973C12.5013 16.7968 12.2002 14.6539 12.2002 12.4998C12.2002 9.32064 13.2821 6.72877 15.4528 4.93845C17.6148 3.15532 20.8174 2.19989 25.0002 2.19989C29.1829 2.19989 32.3856 3.15529 34.5476 4.93842C36.7183 6.72873 37.8001 9.3206 37.8001 12.4998C37.8001 14.375 37.4448 16.586 37.0093 18.6282L36.9141 19.0746ZM33.4772 19.1204L32.6495 19.3399C30.4815 19.9147 27.909 20.2999 25.0002 20.2999C22.0918 20.2999 19.4909 19.9284 17.3217 19.3532L16.4961 19.1344L17.2772 18.7889C19.5468 17.7852 22.1806 17.2 25.0002 17.2C27.807 17.1999 30.4307 17.7791 32.6935 18.7753L33.4772 19.1204ZM14.3805 20.4327L14.535 20.4924C17.2969 21.5597 20.9115 22.1998 25.0002 22.1998C29.0909 22.1998 32.6765 21.5444 35.4402 20.475L35.5944 20.4153L35.7272 20.5139C38.5317 22.5953 40.3001 25.5048 40.3001 28.7497C40.3001 29.1949 40.2528 29.6265 40.1864 30.0466L40.1464 30.2997H32.5001C31.285 30.2997 30.3001 31.2845 30.3001 32.4997C30.3001 34.7431 31.0978 36.7866 32.3881 38.4365L32.6321 38.7486L32.2657 38.8989C30.1027 39.7864 27.634 40.2997 25.0002 40.2997C20.7995 40.2997 16.9849 39.0231 14.2137 36.9447C11.4424 34.8663 9.70026 31.972 9.70026 28.7497C9.70026 25.5152 11.4574 22.6116 14.2476 20.5317L14.3805 20.4327ZM32.2001 32.1997H47.8V32.4997C47.8 36.808 44.3082 40.2997 40.0001 40.2997C35.6919 40.2997 32.2001 36.8078 32.2001 32.4997V32.1997ZM36.7831 18.2459C36.761 18.3528 36.7386 18.4594 36.7159 18.5656C36.6277 18.5029 36.5386 18.4408 36.4487 18.3794C33.3766 16.2813 29.3803 14.9998 25.0002 14.9998C20.5728 14.9998 16.5364 16.3089 13.4513 18.4479C13.3612 18.5103 13.272 18.5735 13.1835 18.6373C13.1617 18.5305 13.1402 18.4229 13.1189 18.3146C12.765 16.5089 12.5002 14.507 12.5002 12.4998C12.5002 6.28658 16.716 2.49989 25.0002 2.49989C33.2843 2.49989 37.5001 6.28649 37.5001 12.4998C37.5001 14.247 37.1857 16.3026 36.7831 18.2459ZM32.0942 19.1719C32.2558 19.1323 32.4153 19.0916 32.5726 19.0499C32.4224 18.9838 32.2706 18.9195 32.1173 18.8572C29.9989 17.9962 27.5792 17.4999 25.0002 17.5C22.4084 17.5 19.9784 18.0018 17.8528 18.8701C17.6998 18.9326 17.5484 18.997 17.3986 19.0633C17.5555 19.1049 17.7148 19.1454 17.8764 19.1848C19.9207 19.6835 22.3281 19.9999 25.0002 19.9999C27.671 19.9999 30.0536 19.6722 32.0942 19.1719ZM31.862 38.7372C29.8055 39.5385 27.4781 39.9997 25.0002 39.9997C16.716 39.9997 10.0003 34.9631 10.0003 28.7497C10.0003 25.6314 11.6936 22.8097 14.4269 20.7722C17.2302 21.8555 20.8827 22.4998 25.0002 22.4998C29.1209 22.4998 32.7443 21.8398 35.5484 20.7548C38.2959 22.7939 40.0001 25.6214 40.0001 28.7497C40.0001 29.1739 39.9551 29.5889 39.8901 29.9997H32.5001C31.1193 29.9997 30.0001 31.1189 30.0001 32.4997C30.0001 34.7051 30.747 36.7209 31.964 38.3739C32.0254 38.4573 32.088 38.5398 32.1518 38.6214C32.0558 38.6607 31.9592 38.6994 31.862 38.7372ZM32.506 32.7997C32.5021 32.7002 32.5001 32.6002 32.5001 32.4997H47.5C47.5 32.6002 47.4981 32.7002 47.4941 32.7997C47.3367 36.8032 44.0421 39.9997 40.0001 39.9997C35.9581 39.9997 32.6635 36.8031 32.506 32.7997Z" fill="white"/>
                                </svg>
                                <p class="text-center sm:text-[16px] text-[12px]">
                                    <?php the_field('1'); ?>
                                </p>
                            </div>
                            <div>
                                <svg width="43" height="42" viewBox="0 0 43 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M40.6691 0.598905C40.8122 0.531046 40.9691 0.497224 41.1275 0.500178C41.286 0.503133 41.4415 0.542781 41.582 0.615913L41.5882 0.619164L41.5882 0.619208C41.7284 0.694745 41.8489 0.80203 41.9403 0.932322C42.0316 1.0626 42.0912 1.21233 42.1146 1.36955L42.1147 1.37029C44.3682 16.6531 42.3293 27.9648 35.875 34.8247L35.8749 34.8248C30.1732 40.88 22.8477 41.5 20.0825 41.5C19.4828 41.5 19.0927 41.4705 18.9697 41.4599H18.9319L18.8778 41.4477C18.8635 41.4445 18.8494 41.441 18.8353 41.4371C18.8022 41.4319 18.7694 41.4251 18.737 41.4166L18.7159 41.4111L18.6954 41.4038C9.38645 38.0854 4.71741 30.3386 2.37836 23.4649C0.0391102 16.5907 0 10.51 0 10.3644V10.3597H2.18451e-05C0.00137496 10.215 0.033325 10.0721 0.0938417 9.9406C0.154361 9.80907 0.24211 9.69176 0.351424 9.59659C0.460743 9.5014 0.589117 9.43054 0.728085 9.38885C0.867056 9.34716 1.01332 9.33564 1.15713 9.35509L1.16189 9.35574L1.16189 9.35576C11.279 10.8236 17.0727 15.5237 18.7204 17.0454C22.9978 11.1043 30.3528 5.60404 40.6651 0.600838L40.6691 0.598887L40.6691 0.598905ZM41.0983 1.50214C30.5822 6.60463 23.2867 12.172 19.2046 18.0942L18.9468 18.4683L18.9513 18.4708L18.6656 18.9204C17.3755 20.9506 16.4629 23.019 15.9224 25.126L15.6535 26.1742L15.0296 25.2901C10.9716 19.5404 5.69011 15.2008 5.15264 14.7649C5.15172 14.765 5.1508 14.7651 5.1499 14.7652C5.14559 14.766 5.14112 14.7684 5.13767 14.7728C5.13416 14.7773 5.13211 14.7833 5.13246 14.7897C5.1326 14.7922 5.13307 14.7946 5.13383 14.7967C5.71666 15.266 11.4377 19.9673 15.5472 26.1027L15.6596 26.2705L15.6239 26.4693C14.5733 32.3182 16.6756 36.8564 18.0324 39.0432L18.8785 40.4069C18.9142 40.4199 18.9499 40.4328 18.9857 40.4456L18.2807 39.3518C16.9504 37.2878 14.414 32.3238 15.741 25.9751L16.2304 26.0773L15.741 25.9751C17.6017 17.0721 26.0199 8.98318 40.4808 1.85055L41.1015 1.54438L41.1972 2.22987C43.2313 16.8082 41.2565 27.5845 35.1341 34.0996C29.3892 40.213 21.6863 40.4932 19.6062 40.4505L19.0462 40.439L19.121 39.8838C19.5116 36.9846 21.8821 23.0029 32.2765 13.7917L32.2976 13.773L32.3206 13.7569C32.323 13.7552 32.3251 13.7529 32.3269 13.75C32.3286 13.7471 32.3298 13.7437 32.3302 13.7401C32.3306 13.7364 32.3303 13.7328 32.3292 13.7293C32.3282 13.7259 32.3265 13.7229 32.3244 13.7206C32.3223 13.7182 32.3199 13.7164 32.3174 13.7153C32.3149 13.7142 32.3123 13.7136 32.3098 13.7136C32.3084 13.7136 32.3069 13.7138 32.3054 13.7141C32.3044 13.7144 32.3033 13.7148 32.3023 13.7152C32.2998 13.7163 32.2974 13.718 32.2952 13.7204L32.2763 13.7414L32.2551 13.7602C22.5845 22.3336 19.8431 35.0743 19.1948 39.1593L18.9904 40.4473C18.9927 40.4481 18.995 40.4489 18.9973 40.4498L19.0517 40.4549L19.082 40.4658C19.2109 40.4762 19.5591 40.5 20.0825 40.5C22.7374 40.5 29.7234 39.8988 35.1467 34.1395C41.2841 27.6163 43.3637 16.6963 41.1254 1.51616L41.6201 1.44323L41.1256 1.5169C41.125 1.5129 41.1235 1.50927 41.1214 1.50627C41.12 1.50433 41.1184 1.50271 41.1167 1.50142C41.1142 1.50052 41.1115 1.50005 41.1089 1.5C41.1053 1.49994 41.1017 1.50064 41.0983 1.50214ZM18.7686 40.3666L17.4055 39.7642C10.0284 36.5041 5.98064 30.1783 3.76145 24.2687C1.5423 18.3592 1.12877 12.8095 1.05306 10.9941L1.02753 10.382L1.63233 10.4796C12.0691 12.1648 17.7208 17.5027 18.397 18.1739C18.4218 18.1833 18.4521 18.1962 18.4846 18.2141L18.4926 18.2185L18.4353 18.1598C17.8699 17.581 12.1489 11.9614 1.02223 10.346C1.01996 10.3458 1.01767 10.346 1.01542 10.3467C1.0129 10.3474 1.01038 10.3488 1.00809 10.3508C1.00579 10.3528 1.00376 10.3554 1.0023 10.3586C1.00097 10.3615 1.00017 10.3647 1.00001 10.368C1.00077 10.5591 1.05523 16.4725 3.32505 23.1428C5.59173 29.8038 10.038 37.1413 18.7686 40.3666ZM40.3003 3.0571C26.2927 10.0786 18.4557 17.8738 16.7198 26.1796L16.3022 26.0924L16.7198 26.1796C15.6707 31.199 17.1838 35.3079 18.4438 37.6578C19.4312 32.5235 22.553 21.0366 31.574 13.0277C31.6659 12.9319 31.7757 12.8548 31.8973 12.8009C32.029 12.7425 32.1716 12.7128 32.3158 12.7136C32.4599 12.7145 32.6021 12.7459 32.7331 12.8058C32.8641 12.8657 32.9809 12.9527 33.0758 13.0608C33.1708 13.1689 33.2418 13.2958 33.2844 13.4331C33.3269 13.5704 33.3402 13.7152 33.3232 13.8579C33.3063 14.0006 33.2596 14.1383 33.186 14.2618C33.118 14.376 33.0284 14.4758 32.9223 14.5556C23.3832 23.0214 20.7764 35.6765 20.194 39.4519C22.7656 39.4134 29.3867 38.7553 34.4054 33.4148C40.1208 27.3327 42.1618 17.1765 40.3003 3.0571ZM2.08455 11.5709C2.22167 13.78 2.74253 18.7108 4.69762 23.9172C6.71443 29.2878 10.2377 34.9028 16.3939 38.1631C15.1024 35.6066 13.7565 31.5171 14.6046 26.4934C12.5218 23.4192 10.0294 20.7136 8.03223 18.7573C7.01682 17.7627 6.13195 16.9642 5.49794 16.4121C5.18098 16.1361 4.92689 15.9218 4.75073 15.7756C4.58601 15.6388 4.49351 15.5649 4.48044 15.5545C4.47928 15.5535 4.47874 15.5531 4.47885 15.5532L4.45064 15.5316L4.42576 15.5063C4.25105 15.3284 4.1475 15.0928 4.13395 14.8442C4.12039 14.5956 4.19771 14.3502 4.35189 14.1543C4.50612 13.9584 4.72677 13.8253 4.97262 13.7811C5.21849 13.7368 5.47184 13.7845 5.68479 13.9148L5.71331 13.9322L5.73925 13.9533C5.7313 13.9468 5.77652 13.9833 5.81446 14.0142C5.86133 14.0524 5.92842 14.1073 6.01404 14.1784C6.18526 14.3206 6.43054 14.5272 6.73625 14.7925C7.34759 15.323 8.20111 16.0889 9.18787 17.0448C10.9783 18.7793 13.2144 21.1462 15.2388 23.874C15.7794 22.1403 16.5603 20.44 17.579 18.7733C16.6086 17.8466 11.3907 13.2333 2.08455 11.5709Z" fill="#3B2F4A"/>
                                </svg>
                                <p class="text-center sm:text-[16px] text-[12px]">
                                    <?php
                                    the_field('2');
                                    ?>
                                </p>
                            </div>
                            <div class="flex flex-col items-center">

                                <svg width="30" height="42" viewBox="0 0 30 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M16.7683 6.67749C16.7683 -2.2244 3.32785 -2.22725 3.32927 6.67749V25.5445C1.5822 27.2889 0.5 29.7075 0.5 32.3798C0.5 37.693 4.77502 42 10.0488 42C15.3225 42 19.5976 37.693 19.5976 32.3798C19.5976 29.7075 18.5154 27.2889 16.7683 25.5445V6.67749ZM10.0488 39.8023C5.94634 39.8023 2.62195 36.4516 2.62195 32.3185C2.62195 30.1052 3.57541 28.117 5.09049 26.7474L5.09756 26.7417L5.10605 26.7246C5.28995 26.5507 5.4102 26.3112 5.43283 26.0447V26.0404C5.43424 26.0205 5.44273 26.0062 5.44415 25.9863L5.45263 25.945V6.67606C5.44839 6.60052 5.44556 6.51216 5.44556 6.42237C5.44556 3.99381 7.39917 2.02559 9.80971 2.02559C9.89459 2.02559 9.97946 2.02844 10.0629 2.03271H10.0516C10.1238 2.02844 10.2072 2.02559 10.2921 2.02559C12.7026 2.02559 14.6562 3.99381 14.6562 6.42237C14.6562 6.51216 14.6534 6.60052 14.6478 6.68746V6.67606V25.945L14.6562 25.9863L14.6661 26.0376C14.6874 26.3098 14.809 26.5507 14.9929 26.7246L15.0014 26.7417C16.5236 28.1184 17.477 30.1066 17.477 32.3185C17.477 36.4516 14.1512 39.8009 10.0488 39.8023ZM11.1098 28.5674V6.66608C11.1098 6.07605 10.6344 5.59717 10.0488 5.59717C9.46312 5.59717 8.9878 6.07605 8.9878 6.66608V28.5674C7.34117 29.0491 6.15854 30.5541 6.15854 32.3385C6.15854 34.5034 7.89995 36.2578 10.0488 36.2578C12.1976 36.2578 13.939 34.5034 13.939 32.3385C13.939 30.5541 12.7564 29.0491 11.1366 28.5745L11.1098 28.5674ZM24.9024 1.32153C22.3632 1.32153 20.3049 3.39522 20.3049 5.95348C20.3049 8.51174 22.3632 10.5854 24.9024 10.5854C27.4417 10.5854 29.5 8.51174 29.5 5.95348C29.4972 3.39664 27.4403 1.32438 24.9024 1.32153ZM24.9024 8.4476C23.5359 8.4476 22.4268 7.33023 22.4268 5.95348C22.4268 4.57672 23.5359 3.45935 24.9024 3.45935C26.269 3.45935 27.378 4.57672 27.378 5.95348C27.3766 7.33023 26.269 8.44618 24.9024 8.4476Z" fill="#3B2F4A"/>
                                </svg>
                                <p class="text-center sm:text-[16px] text-[12px]">
                                    <?php
                                    the_field('3');
                                    ?>
                                </p>
                            </div>
                            <div class="flex flex-col items-center">

                                <svg width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5187 19.088V7.31258C20.5187 6.75028 20.0623 6.29383 19.5 6.29383C18.9377 6.29383 18.4813 6.75028 18.4813 7.31258V19.5001C18.4813 19.7877 18.6014 20.0465 18.795 20.2319L18.8025 20.2391L18.8092 20.247C18.8233 20.2637 18.8373 20.2824 18.8437 20.2908C18.8515 20.3009 18.8553 20.3053 18.8577 20.3079C18.8579 20.3081 18.8575 20.3077 18.8577 20.3079L24.8887 26.3395C25.2865 26.7368 25.9314 26.7369 26.3293 26.3396C26.7271 25.9418 26.7271 25.2963 26.3293 24.8985L20.5187 19.088ZM26.4707 26.481C25.9948 26.9564 25.2233 26.9564 24.7474 26.481L18.7152 20.4482C18.7018 20.4345 18.6905 20.4197 18.6792 20.4049C18.6719 20.3953 18.6645 20.3857 18.6566 20.3763C18.4257 20.1552 18.2812 19.845 18.2812 19.5001V7.31258C18.2812 6.63983 18.8272 6.09383 19.5 6.09383C20.1728 6.09383 20.7188 6.63983 20.7188 7.31258V19.0052L26.4707 24.7571C26.9466 25.233 26.9466 26.0051 26.4707 26.481ZM19.5 0.2C8.84097 0.2 0.2 8.84097 0.2 19.5C0.2 30.1596 8.84097 38.8 19.5 38.8C30.1596 38.8 38.8 30.1596 38.8 19.5C38.8 8.84097 30.1596 0.2 19.5 0.2ZM19.5 36.8009C9.98082 36.8009 2.2375 29.018 2.2375 19.4999C2.2375 9.98133 9.9814 2.23742 19.5 2.23742C29.0186 2.23742 36.7625 9.98136 36.7625 19.4999C36.7625 29.0179 29.0192 36.8009 19.5 36.8009ZM0 19.5C0 8.73052 8.73052 0 19.5 0C30.2701 0 39 8.73052 39 19.5C39 30.2701 30.2701 39 19.5 39C8.73052 39 0 30.2701 0 19.5ZM2.4375 19.4999C2.4375 28.9081 10.0919 36.6009 19.5 36.6009C28.9081 36.6009 36.5625 28.908 36.5625 19.4999C36.5625 10.0918 28.9081 2.43742 19.5 2.43742C10.0919 2.43742 2.4375 10.0918 2.4375 19.4999Z" fill="#3B2F4A"/>
                                </svg>
                                <p class="text-center sm:text-[16px] text-[12px]">
                                    <?php
                                    the_field('4');
                                    ?>
                                </p>
                            </div>

                            <p class="sm:text-[16px] text-[14px]">Настаивание</p>
                        </div>

                    </div>

                    <div class="grid grid-cols-1 gap-5 items-center">
                        <div class="grid grid-cols-5 justify-items-center items-center gap-5 max-w-[500px]">

                            <div class="mt-3">
                                <svg width="45" height="32" viewBox="0 0 45 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M15.4687 0.0886555C9.98637 0.282719 5.26093 0.826096 2.94187 1.54413C1.1953 2.0778 0.21528 2.94139 0.0212169 4.08636C-0.0758148 4.73647 0.147358 5.21193 0.952721 5.98818C2.34998 7.35633 2.94187 8.71477 3.10682 10.9271C3.53376 16.8072 6.01778 22.8911 9.02576 25.4721C9.71468 26.064 10.4715 26.5395 11.141 26.8112C11.665 27.0246 11.6747 27.0441 11.8009 27.5777C12.1017 28.9265 12.9749 29.9841 14.0908 30.3431C15.4978 30.7992 16.8562 30.9253 20.9995 30.9932C25.8996 31.0806 29.383 30.8574 30.9161 30.3431C32.032 29.9744 32.9053 28.9265 33.2061 27.5777C33.3322 27.0344 33.3322 27.0344 33.8853 26.8015C35.7386 26.0543 37.7374 23.9293 39.0668 21.2901C40.629 18.1754 41.6284 14.5173 41.9098 10.8689C42.065 8.72447 42.6666 7.34662 44.0445 5.99788C44.9275 5.1343 45.1312 4.63944 44.9275 3.8923C44.6073 2.6891 43.5496 1.91285 41.5023 1.39858C37.6113 0.408859 31.4207 -0.0277843 22.0183 0.00132561C19.641 0.00132561 16.701 0.0498428 15.4687 0.0886555ZM28.9561 1.63146C37.1261 1.91285 41.7448 2.62118 43.1518 3.80497C43.3168 3.95052 43.4623 4.15428 43.4623 4.24161C43.4623 4.76558 41.968 5.51273 40.0371 5.94937L39.3676 6.10462L38.9988 5.76501C38.077 4.94024 36.5245 4.5133 33.2255 4.2028C28.4418 3.75645 16.536 3.75645 11.7815 4.2028C8.5309 4.5133 6.92017 4.94994 6.02748 5.7456L5.63935 6.09492L4.97954 5.94937C3.0389 5.51273 1.54461 4.76558 1.54461 4.24161C1.54461 4.15428 1.69016 3.95052 1.86482 3.80497C3.22326 2.65029 8.00693 1.90315 15.6433 1.64116C18.8551 1.52472 25.8705 1.52472 28.9561 1.63146ZM31.4304 5.60976C33.9047 5.78441 36.3984 6.13373 36.8447 6.38601C36.9903 6.45393 35.3893 6.60918 32.4007 6.79354C29.8488 6.9585 15.1873 6.9585 12.6547 6.79354C9.7729 6.61889 8.02633 6.45393 8.16218 6.37631C8.8511 6.01729 12.5965 5.60976 16.5845 5.47391C18.6028 5.40599 30.0234 5.50302 31.4304 5.60976ZM5.46469 7.5892C9.08398 8.25872 13.8579 8.511 22.6005 8.52071C31.4789 8.52071 36.5925 8.21021 40.2603 7.46306C41.0656 7.29811 41.1432 7.29811 41.085 7.44366C40.5805 8.72447 40.4834 9.25815 40.27 11.8295C40.0565 14.3717 38.9891 17.9522 37.6598 20.5526C36.0394 23.7353 34.3413 25.2975 32.1581 25.6468C30.79 25.8603 27.9566 26.1611 26.0936 26.2872C23.9783 26.4231 18.9424 26.3454 16.9241 26.1417C14.1975 25.8603 12.2666 25.5789 11.7621 25.3848C9.21982 24.4339 6.74551 20.5138 5.38707 15.2935C4.91161 13.479 4.75636 12.5669 4.65933 10.9368C4.5623 9.51043 4.41675 8.71477 4.05773 7.83178C3.83456 7.24959 3.83456 7.22048 4.02863 7.29811C4.11595 7.33692 4.76607 7.46306 5.46469 7.5892ZM16.9824 27.7039C18.2923 27.83 19.544 27.8688 22.5035 27.8688C26.3362 27.8688 27.617 27.8009 30.6735 27.4031L31.6438 27.2769L31.5856 27.5777C31.4886 28.0629 31.0908 28.5675 30.6347 28.7809C29.6838 29.2467 26.9378 29.4795 22.5035 29.4795C18.0691 29.4795 15.3231 29.2467 14.3722 28.7809C13.9162 28.5675 13.5183 28.0629 13.4213 27.5777L13.3631 27.2769L14.3334 27.4031C14.8671 27.471 16.0606 27.6068 16.9824 27.7039Z" fill="#3B2F4A"/>
                                </svg>

                                <p class="text-center sm:text-[16px] text-[12px]">
                                    <?php
                                    the_field('5');
                                    ?>
                                </p>
                            </div>

                            <div>
                                <svg width="43" height="42" viewBox="0 0 43 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M40.6691 0.598905C40.8122 0.531046 40.9691 0.497224 41.1275 0.500178C41.286 0.503133 41.4415 0.542781 41.582 0.615913L41.5882 0.619164L41.5882 0.619208C41.7284 0.694745 41.8489 0.80203 41.9403 0.932322C42.0316 1.0626 42.0912 1.21233 42.1146 1.36955L42.1147 1.37029C44.3682 16.6531 42.3293 27.9648 35.875 34.8247L35.8749 34.8248C30.1732 40.88 22.8477 41.5 20.0825 41.5C19.4828 41.5 19.0927 41.4705 18.9697 41.4599H18.9319L18.8778 41.4477C18.8635 41.4445 18.8494 41.441 18.8353 41.4371C18.8022 41.4319 18.7694 41.4251 18.737 41.4166L18.7159 41.4111L18.6954 41.4038C9.38645 38.0854 4.71741 30.3386 2.37836 23.4649C0.0391102 16.5907 0 10.51 0 10.3644V10.3597H2.18451e-05C0.00137496 10.215 0.033325 10.0721 0.0938417 9.9406C0.154361 9.80907 0.24211 9.69176 0.351424 9.59659C0.460743 9.5014 0.589117 9.43054 0.728085 9.38885C0.867056 9.34716 1.01332 9.33564 1.15713 9.35509L1.16189 9.35574L1.16189 9.35576C11.279 10.8236 17.0727 15.5237 18.7204 17.0454C22.9978 11.1043 30.3528 5.60404 40.6651 0.600838L40.6691 0.598887L40.6691 0.598905ZM41.0983 1.50214C30.5822 6.60463 23.2867 12.172 19.2046 18.0942L18.9468 18.4683L18.9513 18.4708L18.6656 18.9204C17.3755 20.9506 16.4629 23.019 15.9224 25.126L15.6535 26.1742L15.0296 25.2901C10.9716 19.5404 5.69011 15.2008 5.15264 14.7649C5.15172 14.765 5.1508 14.7651 5.1499 14.7652C5.14559 14.766 5.14112 14.7684 5.13767 14.7728C5.13416 14.7773 5.13211 14.7833 5.13246 14.7897C5.1326 14.7922 5.13307 14.7946 5.13383 14.7967C5.71666 15.266 11.4377 19.9673 15.5472 26.1027L15.6596 26.2705L15.6239 26.4693C14.5733 32.3182 16.6756 36.8564 18.0324 39.0432L18.8785 40.4069C18.9142 40.4199 18.9499 40.4328 18.9857 40.4456L18.2807 39.3518C16.9504 37.2878 14.414 32.3238 15.741 25.9751L16.2304 26.0773L15.741 25.9751C17.6017 17.0721 26.0199 8.98318 40.4808 1.85055L41.1015 1.54438L41.1972 2.22987C43.2313 16.8082 41.2565 27.5845 35.1341 34.0996C29.3892 40.213 21.6863 40.4932 19.6062 40.4505L19.0462 40.439L19.121 39.8838C19.5116 36.9846 21.8821 23.0029 32.2765 13.7917L32.2976 13.773L32.3206 13.7569C32.323 13.7552 32.3251 13.7529 32.3269 13.75C32.3286 13.7471 32.3298 13.7437 32.3302 13.7401C32.3306 13.7364 32.3303 13.7328 32.3292 13.7293C32.3282 13.7259 32.3265 13.7229 32.3244 13.7206C32.3223 13.7182 32.3199 13.7164 32.3174 13.7153C32.3149 13.7142 32.3123 13.7136 32.3098 13.7136C32.3084 13.7136 32.3069 13.7138 32.3054 13.7141C32.3044 13.7144 32.3033 13.7148 32.3023 13.7152C32.2998 13.7163 32.2974 13.718 32.2952 13.7204L32.2763 13.7414L32.2551 13.7602C22.5845 22.3336 19.8431 35.0743 19.1948 39.1593L18.9904 40.4473C18.9927 40.4481 18.995 40.4489 18.9973 40.4498L19.0517 40.4549L19.082 40.4658C19.2109 40.4762 19.5591 40.5 20.0825 40.5C22.7374 40.5 29.7234 39.8988 35.1467 34.1395C41.2841 27.6163 43.3637 16.6963 41.1254 1.51616L41.6201 1.44323L41.1256 1.5169C41.125 1.5129 41.1235 1.50927 41.1214 1.50627C41.12 1.50433 41.1184 1.50271 41.1167 1.50142C41.1142 1.50052 41.1115 1.50005 41.1089 1.5C41.1053 1.49994 41.1017 1.50064 41.0983 1.50214ZM18.7686 40.3666L17.4055 39.7642C10.0284 36.5041 5.98064 30.1783 3.76145 24.2687C1.5423 18.3592 1.12877 12.8095 1.05306 10.9941L1.02753 10.382L1.63233 10.4796C12.0691 12.1648 17.7208 17.5027 18.397 18.1739C18.4218 18.1833 18.4521 18.1962 18.4846 18.2141L18.4926 18.2185L18.4353 18.1598C17.8699 17.581 12.1489 11.9614 1.02223 10.346C1.01996 10.3458 1.01767 10.346 1.01542 10.3467C1.0129 10.3474 1.01038 10.3488 1.00809 10.3508C1.00579 10.3528 1.00376 10.3554 1.0023 10.3586C1.00097 10.3615 1.00017 10.3647 1.00001 10.368C1.00077 10.5591 1.05523 16.4725 3.32505 23.1428C5.59173 29.8038 10.038 37.1413 18.7686 40.3666ZM40.3003 3.0571C26.2927 10.0786 18.4557 17.8738 16.7198 26.1796L16.3022 26.0924L16.7198 26.1796C15.6707 31.199 17.1838 35.3079 18.4438 37.6578C19.4312 32.5235 22.553 21.0366 31.574 13.0277C31.6659 12.9319 31.7757 12.8548 31.8973 12.8009C32.029 12.7425 32.1716 12.7128 32.3158 12.7136C32.4599 12.7145 32.6021 12.7459 32.7331 12.8058C32.8641 12.8657 32.9809 12.9527 33.0758 13.0608C33.1708 13.1689 33.2418 13.2958 33.2844 13.4331C33.3269 13.5704 33.3402 13.7152 33.3232 13.8579C33.3063 14.0006 33.2596 14.1383 33.186 14.2618C33.118 14.376 33.0284 14.4758 32.9223 14.5556C23.3832 23.0214 20.7764 35.6765 20.194 39.4519C22.7656 39.4134 29.3867 38.7553 34.4054 33.4148C40.1208 27.3327 42.1618 17.1765 40.3003 3.0571ZM2.08455 11.5709C2.22167 13.78 2.74253 18.7108 4.69762 23.9172C6.71443 29.2878 10.2377 34.9028 16.3939 38.1631C15.1024 35.6066 13.7565 31.5171 14.6046 26.4934C12.5218 23.4192 10.0294 20.7136 8.03223 18.7573C7.01682 17.7627 6.13195 16.9642 5.49794 16.4121C5.18098 16.1361 4.92689 15.9218 4.75073 15.7756C4.58601 15.6388 4.49351 15.5649 4.48044 15.5545C4.47928 15.5535 4.47874 15.5531 4.47885 15.5532L4.45064 15.5316L4.42576 15.5063C4.25105 15.3284 4.1475 15.0928 4.13395 14.8442C4.12039 14.5956 4.19771 14.3502 4.35189 14.1543C4.50612 13.9584 4.72677 13.8253 4.97262 13.7811C5.21849 13.7368 5.47184 13.7845 5.68479 13.9148L5.71331 13.9322L5.73925 13.9533C5.7313 13.9468 5.77652 13.9833 5.81446 14.0142C5.86133 14.0524 5.92842 14.1073 6.01404 14.1784C6.18526 14.3206 6.43054 14.5272 6.73625 14.7925C7.34759 15.323 8.20111 16.0889 9.18787 17.0448C10.9783 18.7793 13.2144 21.1462 15.2388 23.874C15.7794 22.1403 16.5603 20.44 17.579 18.7733C16.6086 17.8466 11.3907 13.2333 2.08455 11.5709Z" fill="#3B2F4A"/>
                                </svg>
                                <p class="text-center sm:text-[16px] text-[12px]">
                                    <?php
                                    the_field('6');
                                    ?>
                                </p>
                            </div>
                            <div class="flex flex-col items-center">

                                <svg width="30" height="42" viewBox="0 0 30 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M16.7683 6.67749C16.7683 -2.2244 3.32785 -2.22725 3.32927 6.67749V25.5445C1.5822 27.2889 0.5 29.7075 0.5 32.3798C0.5 37.693 4.77502 42 10.0488 42C15.3225 42 19.5976 37.693 19.5976 32.3798C19.5976 29.7075 18.5154 27.2889 16.7683 25.5445V6.67749ZM10.0488 39.8023C5.94634 39.8023 2.62195 36.4516 2.62195 32.3185C2.62195 30.1052 3.57541 28.117 5.09049 26.7474L5.09756 26.7417L5.10605 26.7246C5.28995 26.5507 5.4102 26.3112 5.43283 26.0447V26.0404C5.43424 26.0205 5.44273 26.0062 5.44415 25.9863L5.45263 25.945V6.67606C5.44839 6.60052 5.44556 6.51216 5.44556 6.42237C5.44556 3.99381 7.39917 2.02559 9.80971 2.02559C9.89459 2.02559 9.97946 2.02844 10.0629 2.03271H10.0516C10.1238 2.02844 10.2072 2.02559 10.2921 2.02559C12.7026 2.02559 14.6562 3.99381 14.6562 6.42237C14.6562 6.51216 14.6534 6.60052 14.6478 6.68746V6.67606V25.945L14.6562 25.9863L14.6661 26.0376C14.6874 26.3098 14.809 26.5507 14.9929 26.7246L15.0014 26.7417C16.5236 28.1184 17.477 30.1066 17.477 32.3185C17.477 36.4516 14.1512 39.8009 10.0488 39.8023ZM11.1098 28.5674V6.66608C11.1098 6.07605 10.6344 5.59717 10.0488 5.59717C9.46312 5.59717 8.9878 6.07605 8.9878 6.66608V28.5674C7.34117 29.0491 6.15854 30.5541 6.15854 32.3385C6.15854 34.5034 7.89995 36.2578 10.0488 36.2578C12.1976 36.2578 13.939 34.5034 13.939 32.3385C13.939 30.5541 12.7564 29.0491 11.1366 28.5745L11.1098 28.5674ZM24.9024 1.32153C22.3632 1.32153 20.3049 3.39522 20.3049 5.95348C20.3049 8.51174 22.3632 10.5854 24.9024 10.5854C27.4417 10.5854 29.5 8.51174 29.5 5.95348C29.4972 3.39664 27.4403 1.32438 24.9024 1.32153ZM24.9024 8.4476C23.5359 8.4476 22.4268 7.33023 22.4268 5.95348C22.4268 4.57672 23.5359 3.45935 24.9024 3.45935C26.269 3.45935 27.378 4.57672 27.378 5.95348C27.3766 7.33023 26.269 8.44618 24.9024 8.4476Z" fill="#3B2F4A"/>
                                </svg>
                                <p class="text-center sm:text-[16px] text-[12px]">
                                    <?php
                                    the_field('7');
                                    ?>
                                </p>
                            </div>
                            <div class="flex flex-col items-center">

                                <svg width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5187 19.088V7.31258C20.5187 6.75028 20.0623 6.29383 19.5 6.29383C18.9377 6.29383 18.4813 6.75028 18.4813 7.31258V19.5001C18.4813 19.7877 18.6014 20.0465 18.795 20.2319L18.8025 20.2391L18.8092 20.247C18.8233 20.2637 18.8373 20.2824 18.8437 20.2908C18.8515 20.3009 18.8553 20.3053 18.8577 20.3079C18.8579 20.3081 18.8575 20.3077 18.8577 20.3079L24.8887 26.3395C25.2865 26.7368 25.9314 26.7369 26.3293 26.3396C26.7271 25.9418 26.7271 25.2963 26.3293 24.8985L20.5187 19.088ZM26.4707 26.481C25.9948 26.9564 25.2233 26.9564 24.7474 26.481L18.7152 20.4482C18.7018 20.4345 18.6905 20.4197 18.6792 20.4049C18.6719 20.3953 18.6645 20.3857 18.6566 20.3763C18.4257 20.1552 18.2812 19.845 18.2812 19.5001V7.31258C18.2812 6.63983 18.8272 6.09383 19.5 6.09383C20.1728 6.09383 20.7188 6.63983 20.7188 7.31258V19.0052L26.4707 24.7571C26.9466 25.233 26.9466 26.0051 26.4707 26.481ZM19.5 0.2C8.84097 0.2 0.2 8.84097 0.2 19.5C0.2 30.1596 8.84097 38.8 19.5 38.8C30.1596 38.8 38.8 30.1596 38.8 19.5C38.8 8.84097 30.1596 0.2 19.5 0.2ZM19.5 36.8009C9.98082 36.8009 2.2375 29.018 2.2375 19.4999C2.2375 9.98133 9.9814 2.23742 19.5 2.23742C29.0186 2.23742 36.7625 9.98136 36.7625 19.4999C36.7625 29.0179 29.0192 36.8009 19.5 36.8009ZM0 19.5C0 8.73052 8.73052 0 19.5 0C30.2701 0 39 8.73052 39 19.5C39 30.2701 30.2701 39 19.5 39C8.73052 39 0 30.2701 0 19.5ZM2.4375 19.4999C2.4375 28.9081 10.0919 36.6009 19.5 36.6009C28.9081 36.6009 36.5625 28.908 36.5625 19.4999C36.5625 10.0918 28.9081 2.43742 19.5 2.43742C10.0919 2.43742 2.4375 10.0918 2.4375 19.4999Z" fill="#3B2F4A"/>
                                </svg>
                                <p class="text-center">
                                    <?php
                                    the_field('8');
                                    ?>
                                </p>
                            </div>
                            <p class="sm:text-[16px] text-[14px]">Пролив</p>
                        </div>

                    </div>

            </div>
        </div>
        <div class="xl:pl-[36px] pl-0 grid md:grid-cols-2 grid-cols-1 xl:col-span-4 gap-5 justify-items-center">
            <div class="grid grid-cols-1 gap-5">
                <p class="font-semibold text-[20px]">Карта вкусов Лун Цзин</p>
                <p>
                    Чай густой и слегка сладкий, со свежим травянистым ароматом. Он обладает пикантным жареным привкусом, который не уменьшает его более нежных травянистых и цветочных нот.
                </p>
                <p>
                    Настой сытный: в первом проливе кисловато-солёный, а затем только солёно-минеральный, с горчинкой, но совсем не терпкий.
                </p>
                <p>
                    В поздних проливах во вкусе проявляются морские нотки и сладкое послевкусие.
                </p>
            </div>
            <div class="relative max-w-[300px] w-[300px] h-[300px]">
                <img class="object-contain absolute top-0 left-0 right-0 bottom-0" src="<?php echo the_field('tea_image'); ?>" alt="tea">
            </div>


        </div>
    </div>  -->


    <!-- <div class="mt-10 grid md:grid-cols-2 grid-cols-1 md:gap-10 gap-5">
        <div class="grid grid-cols-1 gap-5">
            <p class="font-semibold text-[20px]">
                Подробная информация о чае Лун Цзин   I   龍 井 茶   I   龙 井 茶
            </p>
            <p>
                Чай Лун Цзин подвергается обжарке, в процессе которой ферменты в чайных листьях денатурируются под воздействием тепла, что останавливает ферментацию. Настой чая имеет желтоватый оттенок, и чем выше его качество, тем дольше сохраняется сладковатое послевкусие.
            </p>
            <p>
                Чай Лун Цзин можно употреблять вместе с листьями, так как они богаты катехинами и теанином и полезны для здоровья. Чай также содержит некоторое количество кофеина, поэтому лучше избегать его употребления перед сном.
            </p>
            <p>
                Чай Лун Цзин славится своим ярким цветом, красивой формой, насыщенным ароматом и мягким вкусом. Его уникальные качества, такие как "лёгкость", "аромат и чистота", выделяют его среди множества других чаёв, и он входит в десятку лучших чаёв Китая.
            </p>
        </div>
        <div class="grid grid-cols-1 gap-5">
            <p class="md:mt-12 mt-0">История чая Лун Цзин берет начало в доимперский период, когда чайная культура в Ханчжоу только начала развиваться. В период Троецарствия и династий Цзинь, вдоль реки Цяньтан началось развитие экономики и культуры, а строительство храмов способствовало распространению чая.</p>
            <p>
                Во времена династии Мин чай из Лунцзина стал известен своим высочайшим качеством и превратился в "королевский дар”. В 21 веке Лун Цзин стал признанным лидером среди китайских чаёв и в 2020 году он был включён в список культурных памятников Чжэцзяна.
            </p>
            <p>
                 Зона производства Лунцзинского чая охватывает четыре города: Ханчжоу, Шаосин, Цзиньхуа и Тайчжоу, с восемнадцатью районами.
            </p>
        </div>
    </div> -->


    <!-- ----------------------- -->

    <div class="mt-10 mb-7">
        <div class="font-title text-xl xl:text-4xl text-center">
            <span>Добавить к чаю шоколад ручной работы</span>
        </div>
    </div>

</div>


<?php

if (has_term(18, 'product_cat', $product->get_id())) {
    $args = array(
        'post_type' => 'product',
        'posts_per_page' => 15,
        'tax_query' => array(
            array(
                'taxonomy' => 'product_cat', // Укажите таксономию "product_cat" (категории товаров)
                'field' => 'slug', // Используйте поле "slug" для поиска по slug категории
                'terms' => array('sladosti'), // Укажите slug категории "сладости"
                'operator' => 'IN', // Выберите товары, **входящие** в категорию "сладости"
            )
        ),
    );
} else {
    $args = array(
        'post_type' => 'product',
        'posts_per_page' => 15,
        'tax_query' => array(
            array(
                'taxonomy' => 'product_cat', // Укажите таксономию "product_cat" (категории товаров)
                'field' => 'slug', // Используйте поле "slug" для поиска по slug категории
                'terms' => array('sladosti'), // Укажите slug категории "сладости"
                'operator' => 'IN', // Выберите товары, **входящие** в категорию "сладости"
            )
        ),
    );
}

$i = 1;
$query = new WP_Query($args); ?>

<?php if ($query->have_posts()) : ?>


    <?php if (has_term(18, 'product_cat', $product->get_id())) : ?>

        <div class="swiper swiper-products-horizontal w-full">
            <div class="swiper-wrapper pb-8">
                <?php while ($query->have_posts()) :
                    $query->the_post();
                    $i++; ?>
                    <?php
                    $post_id = get_the_ID();
                    $product = wc_get_product($post_id);
                    ?>
                    <div class="swiper-slide max-w-[800px]">
                        <?php get_template_part('template-parts/blocks/product-card-horizontal'); ?>
                    </div>
                <?php endwhile; ?>
            </div>

        </div>

    <?php else : ?>

        <div class="swiper swiper-products-standard w-full">
            <div class="swiper-wrapper pb-4">
                <?php while ($query->have_posts()) :
                    $query->the_post();
                    $i++; ?>
                    <?php
                    $post_id = get_the_ID();
                    $product = wc_get_product($post_id);
                    ?>
                    <div class="swiper-slide">
                        <?php get_template_part('template-parts/blocks/product-card'); ?>
                    </div>
                <?php endwhile; ?>
            </div>

        </div>

    <?php endif; ?>

    <div class="container">

        <!-- <div class="grid lg:grid-cols-2 grid-cols-1 gap-5">
        <div class="relative">
            <img class="object-cover" src="<?php echo get_template_directory_uri(); ?>/images/tea/gift-1.png" alt="tea">
            <img class="absolute bottom-[-10px] left-[320px] object-cover hidden 2xl:block" src="<?php echo get_template_directory_uri(); ?>/images/tea/gift-2.png" alt="tea">
        </div>
        <div class="flex flex-col sm:space-y-10 space-y-5">
            <div>
                <p class="xl:text-[43px] sm:text-[30px] text-[22px]">
                    Оформить чай в подарочном наборе
                </p>
                <p class="xl:text-[28px] sm:text-[24px] text-[18px]">
                    Изготовлено людьми с инвалтдностью и пенсионерами
                </p>
            </div>

            <ul class="ml-[25px] list-disc xl:text-[25px] sm:text-[18px] text-[16px]">
                <li>К чаю, шоколад ручной работы, вязаные зверята</li>
                <li>Открытка с вашими пожеланиями</li>
                <li>Инструкция по заварке чая</li>
                <li>Всё создано вручную</li>
            </ul>
            <p class="xl:text-[25px] sm:text-[18px] text-[16px]">Уникальный подарок, и плюсик в карму</p>
            <bottom class="border border-[#EF3343] rounded text-[#EF3343] lg:px-24 px-5 py-3 flex-shrink-0 self-start">Выбрать подарочный набор</bottom>
        </div>
    </div> -->
    </div>





    <?php wp_reset_postdata(); ?>

<?php else : ?>
<?php endif; ?>

<?php do_action('woocommerce_after_single_product'); ?>
