<?php

/**
 * Template Name: Delivery & refund
 */

get_header();
?>

<section id="primary">
	<main id="main">

		<div class="container max-w-7xl mb-16">


			<div class="bg-white px-4 lg:px-10 py-3 lg:py-8 shadow rounded-xl max-w-[805px] mx-auto mb-4 lg:mb-8">
				<div class="font-title text-primary text-2xl text-center mb-5">
					Страны для доставки <br>
					Россия, Беларусь, Армения, Казахстан, Киргизия
				</div>
				<div class="flex flex-col space-y-4 lg:text-xl text-center font-light">
					<p>
						Если вы хотите получить товары, но не видите вашу страну в этом списке, напишите нам. Мы что-нибудь придумаем.
					</p>
				</div>

				<div class="grid lg:grid-cols-3 items-center gap-4 lg:gap-8 mt-4">
					<a class="group btn-border" href="https://t.me/nitisveta">
						<svg class="mr-3" width="30" height="25" viewBox="0 0 30 25" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M1.83886 10.6406L19.7112 3.38849C21.4749 2.63306 27.4559 0.215701 27.4559 0.215701C27.4559 0.215701 30.2164 -0.841894 29.9864 1.72655C29.9097 2.78415 29.2963 6.48573 28.6828 10.4953L26.7658 22.3613C26.7658 22.3613 26.6125 24.0988 25.3089 24.4009C24.0053 24.7031 21.8583 23.3433 21.4749 23.0412C21.1682 22.8145 15.7239 19.4151 13.7302 17.7532C13.1934 17.2999 12.58 16.3934 13.8069 15.3358C16.5674 12.8429 19.8646 9.74568 21.8583 7.78157C22.7784 6.87506 23.6986 4.75987 19.8646 7.32832L9.0468 14.4932C9.0468 14.4932 7.81991 15.2487 5.51951 14.5688C3.21911 13.8889 0.5353 12.9824 0.5353 12.9824C0.5353 12.9824 -1.30502 11.8492 1.83886 10.6406Z" fill="#3B2F4A" class="group-hover:fill-white" />
						</svg>
						<span>Telegram</span>
					</a>
					<a class="group btn-border" href="https://wa.me/+79650543710">
						<svg class="mr-3" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M0.41898 14.8675C0.417996 17.4473 1.09183 19.9657 2.37319 22.1854L0.295898 29.7699L8.05827 27.7346C10.1969 28.9008 12.6048 29.5155 15.0552 29.5165H15.0615C23.1311 29.5165 29.7004 22.9492 29.704 14.879C29.7053 10.9676 28.1833 7.28988 25.4191 4.523C22.6542 1.75644 18.9781 0.231866 15.0615 0.230225C6.99025 0.230225 0.421934 6.79624 0.418652 14.8671L0.41898 14.8675ZM5.04096 21.8031L4.75114 21.3429C3.53279 19.4057 2.88981 17.167 2.89047 14.8685C2.89342 8.16032 8.35268 2.70237 15.0657 2.70237C18.3167 2.70368 21.3718 3.97093 23.67 6.27043C25.9679 8.56993 27.2325 11.627 27.2315 14.8776C27.2285 21.5861 21.7689 27.0441 15.0611 27.0441H15.0562C12.8719 27.0427 10.73 26.4565 8.86208 25.3478L8.41734 25.0843L3.81079 26.2921L5.04096 21.8031ZM15.0615 29.5165C15.0611 29.5165 15.0611 29.5165 15.0615 29.5165V29.5165Z" fill="#3B2F4A" class="group-hover:fill-white" />
							<path d="M11.402 8.74738C11.1279 8.13821 10.8394 8.12574 10.5788 8.11523C10.3655 8.10604 10.1213 8.1067 9.87776 8.1067C9.63356 8.1067 9.2374 8.19827 8.90229 8.56424C8.56685 8.93053 7.62158 9.81541 7.62158 11.6154C7.62158 13.4156 8.93282 15.1549 9.11531 15.3994C9.29845 15.6433 11.6465 19.4552 15.3649 20.9217C18.4554 22.1403 19.0846 21.8981 19.7552 21.8371C20.4261 21.776 21.9198 20.9522 22.2247 20.0978C22.5296 19.2435 22.5296 18.5112 22.4384 18.3586C22.3468 18.206 22.1029 18.1144 21.737 17.9316C21.371 17.7485 19.5724 16.8636 19.2369 16.7415C18.9015 16.6194 18.6576 16.5587 18.4134 16.925C18.1696 17.2909 17.4688 18.1147 17.2555 18.3586C17.0421 18.6031 16.8284 18.6337 16.4628 18.4505C16.0968 18.267 14.9185 17.8811 13.5207 16.6348C12.4329 15.6649 11.6987 14.4676 11.4854 14.1013C11.272 13.7353 11.4627 13.5374 11.6459 13.3549C11.8103 13.1911 12.0118 12.9279 12.195 12.7142C12.3775 12.5006 12.4385 12.3479 12.5603 12.1041C12.6824 11.8599 12.6213 11.6462 12.5298 11.4631C12.4382 11.2799 11.7273 9.47078 11.402 8.74738Z" fill="#3B2F4A" class="group-hover:fill-white" />
						</svg>
						<span>WhatsApp</span>
					</a>
					<a class="btn-border copy-link" data-clipboard-text="nitisveta.ru@gmail.com">
						<span>nitisveta.ru@gmail.com</span>
					</a>
				</div>

				<div class="flex flex-col space-y-4 lg:text-xl mt-5 text-center font-light">
					<p>
						Мы активно работаем над добавлением новых стран. <br>
						Так как наши товары, это буквально ручная работа, а не промышленное производство, они требуют специфических таможенных документов.
					</p>
				</div>
			</div>

			<div class="bg-white px-4 lg:px-10 py-3 lg:py-8 shadow rounded-xl max-w-[805px] mx-auto mb-4 lg:mb-8">
				<div class="font-title text-primary text-2xl text-center mb-5">
					Не понравился товар?
				</div>
				<div class="flex flex-col space-y-4 lg:text-xl text-center font-light">
					<p>
						Напишите нам, отправьте товар обратно в течении 15-ти дней
						и мы вернем вам деньги. К сожалению, стоимость доставки мы возместить не сможем.
					</p>
				</div>
			</div>

			<div class="bg-white px-4 lg:px-10 py-3 lg:py-8 shadow rounded-xl max-w-[805px] mx-auto mb-4 lg:mb-8">
				<div class="font-title text-primary text-2xl mb-5">
					В случае если вы решите вернуть товар
				</div>

				<div class="flex flex-col space-y-4 text-sm leading-6 mb-4">
					<p>
						1. В течении 15 календарных дней после получения товара, напишите нам через любой доступный мессенджер или по email на адрес nitisveta.ru@gmail.com <br>
						2. Мы сообщим вам адрес. <br>
						3. Отправьте товар обратно на указанный адрес с помощью курьерской службы. <br>
						4. После получения товара, если он получен в том же виде, в каком был отпарвлен (без повреждений) мы вернём вам всю его стоимость. К сожалению, вернуть средства за доставку мы не можем, так как они уже потрачены на оплату работы курьерской компании.
					</p>
				</div>

				<div class="font-title text-primary text-2xl mb-5">
					Доставка осуществляется сторонними курьерскими
					службами
				</div>

				<div class="flex flex-col space-y-4 text-sm leading-6 mb-4">
					<p>
						Мы обязуемся передать товар курьерской службе в течении 10-ти рабочих дней с момента оформления заказа. В случае не отправки товара, мы вернем вам всю сумму товара и доставки.
						”Нити Света” Благотворительный интернет магазин (nitisveta.ru) и ИП Васильев Игорь Александрович не несут ответственности за возможные ошибки курьерской службы.
						Но мы сделаем всё что в наших силах, чтобы помочь вам в сложной ситуации.

					</p>
					<p>
						Территория доставки товаров, представленных на cайте и ограничена странами Россия, Беларусь, Армения, Казахстан, Киргизия. Доставка в другие страны возможна в индивидуальном порядке по договоренности с Продавцом.
					</p>
				</div>
			</div>

			<div class="bg-white px-4 lg:px-10 py-3 lg:py-8 shadow rounded-xl max-w-[805px] mx-auto mb-4 lg:mb-8">
				<div class="font-title text-primary text-2xl mb-5">
					Подпишитесь и мы будем отправлять вам на email
					промо коды и рассылку с новинками каталога
				</div>

				<div class="mt-4">
					<?php echo do_shortcode('[contact-form-7 id="8533f74" title="Подписка"]'); ?>
				</div>
			</div>

			<!-- <h1 class="font-title text-3xl xl:text-[40px]">Доставка и возврат</h1>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					В случае если вы решите вернуть товар
				</div>
				<div class="text-sm xl:col-span-3 leading-6">
					<p>
						1. Напишите нам через любой доступный мессенджер или по email на адрес nitisveta.ru@gmail.com <br>
						2. Мы сообщим вам адрес. <br>
						3. Отпарвте товар обратно на указанный адрес с помощью курьерской службы. <br>
						4. После получения товара, если он получен в том же виде, в каком был отпарвлен (без повреждений) мы вернём вам всю его стоимость. К сожалению, вернуть средства за доставку мы не можем, так как они уже потрачены на облату работы курьерской компании.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-8 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					Доставка осуществляется <br>
					сторонними курьерскими <br>
					службами
				</div>
				<div class="text-sm xl:col-span-3 leading-6 flex flex-col gap-8">
					<p>
						Мы обязуемся передать товар курьерской службе в течении 7-ми рабочих дней с момента оформления заказа. В случае не отправки товара, мы вернем вам всю сумму товара и доставки. <br>
						”Нити Света” Благотворительный интернет магазин и ИП Васильев Игорь Александрович не несут ответственности за возможные ошибки курьерской службы. <br>
						Но мы сделаем всё что в наших силах, чтобы помочь вам в сложной ситуации.
					</p>
					<p>
						Территория доставки Товаров, представленных на Сайте и реализуемых Продавцом, ограничена странами Россия, Беларусь, Армения, Казахстан, Киргизия. <br>
						Доставка в другие страны возможна в индивидуальном порядке по договоренности с Продавцом.
					</p>
				</div>
			</div> -->
		</div>

	</main><!-- #main -->
</section><!-- #primary -->

<?php
get_footer();
