<?php

/**
 * Template Name: Public offert
 */

get_header();
?>

<section id="primary">
	<main id="main">

		<div class="container max-w-7xl mb-16">

			<h1 class="font-title text-3xl xl:text-[40px]">Публичная оферта магазина Нити света (nitisveta.ru) <br>
				для физических и юридических лиц.
			</h1>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					1. Термины и определения
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						Термины, используемые в документе и на сайте nitisveta.ru Благотворительный интернет магазин, следует трактовать согласно настоящему разделу. В случае отсутствия определения в настоящем разделе, термины трактуются согласно законодательству РФ.
					</p>
					<p>
						1.1.1. Продавец – ИП ВАСИЛЬЕВ ИГОРЬ АЛЕКСАНДРОВИЧ; <br>
						1.1.2. Сайт – доступный по адресу: https://nitisveta.ru включая поддомены, а также программное обеспечение, представленное на сайте; <br>
						1.1.3. Посетитель – лицо, просматривающее Сайт без цели регистрации и (или) Заказа; <br>
						1.1.4. Пользователь – посетитель Сайта, завершивший процедуру регистрации на Сайте и принявший условия Оферты; <br>
						1.1.5. Покупатель – Пользователь, который оформил Заказ; <br>
						1.1.6. Товар – товары и услуги, представленные в каталоге на Сайте; <br>
						1.1.7. Заказ – сформированный на Сайте Покупателем запрос на покупку Товаров для личных, семейных, домашних и иных нужд, не связанных с осуществлением предпринимательской деятельности, содержащий количество, ассортимент и комплектность Товара.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					2. Общие положения. <br> Предмет публичной оферты
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						2.1. Продавец предлагает сделать Заказ на изложенных ниже условиях. Условия являются публичной офертой в соответствии со статьей 437 Гражданского кодекса Российской Федерации (далее – «Оферта»). Предложение распространяется на все виды Товара, пока Товар с описанием присутствует на Сайте.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					3. Акцепт оферты. <br> Изменение оферты
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						3.1. Акцепт Оферты (заключение договора розничной купли-продажи и(или) договора оказания услуг) (далее – «Договор») происходит в момент Заказа. <br>
						3.2. Договор считается заключенным с момента предоставления Покупателю кассового или товарного чека, либо иного документа, подтверждающего оплату Товара. <br>
						3.3. Покупатель соглашается с тем, что Продавец может поручить исполнение Договора третьим лицам, но при этом Продавец самостоятельно несет ответственность за исполнение Договора. Все права и обязательства перед Покупателем по Договору возникают непосредственно у Продавца, кроме обязательств по работе сторонней курьерской службы доставки. <br>
						3.4. Продавец может в любой момент изменить условия Оферты в одностороннем порядке без предварительного уведомления. Новая редакция Оферты действительна с момента ее опубликования на Сайте.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					4. Условия о товаре. <br>
					Порядок оформления заказа
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						4.1. Чтобы оформить Заказ Покупатель добавляет Товар «В корзину» на Сайте, заполняет форму (ФИО, телефон, e-mail, адрес доставки, способ доставки) и нажимает на кнопку «Оплатить картой онлайн». Оплачивает через банковский эквайринг, после чего Заказ считается оформленным. <br>
						4.2. После оформления Заказа на Сайте, Покупателю направляется автоматическое электронное сообщение с чеком, по адресу электронной почты, указанному Покупателем при оформлении Заказа. <br>
						4.3. При необходимости Продавец, уточняет детали Заказа, согласовывает дату доставки Заказа по электронной почте и (или) мессенджерам. Дата доставки зависит от наличия Товара на складе Продавца и времени, необходимого для обработки и доставки Заказа сторонними курьерскими службами. <br>
						4.4. Ожидаемая дата доставки Заказа сообщается Покупателю по электронной почте или при контрольном звонке Покупателю. Дата передачи Товара может быть изменена Продавцом в одностороннем порядке в случае наличия непредвиденных обстоятельств, произошедших не по вине Продавца. <br>
						4.5. Покупатель несет ответственность за предоставление неверных сведений, повлекшее за собой невозможность надлежащего исполнения Продавцом своих обязательств перед Покупателем. <br>
						4.6. Фотографии, сопровождающие Товар, являются простыми иллюстрациями к Товару и могут отличаться от фактического внешнего вида Товара. Описания и(или) характеристики Товара не претендуют на исчерпывающую информативность и могут содержать опечатки. Для уточнения информации о Товаре Покупатель может обратиться к Продавцу доступными на Сайте способами. <br>
						4.7. Продавец обеспечивает наличие Товара, представленного на Сайте. Если Товар отсутствует в наличии, он недоступен на Сайте и кнопка «В корзину» становится неактивной. <br>
						4.8. При отсутствии заказанного Покупателем Товара на складе Продавца, последний вправе исключить Товар из Заказа или аннулировать Заказ Покупателя. В таком случае Продавец уведомляет Покупателя электронным письмом по адресу, указанному Покупателем при регистрации либо звонком по телефону, либо черезе мессенджер. <br>
						4.9. В случае аннулирования полностью либо частично предоплаченного Заказа стоимость аннулированного Товара возвращается Покупателю способом, которым Товар был оплачен. Кроме стоимости доставки, оплаченной сторонней курьерской службе. <br>
						4.10 Товары изготовлены вручную и могут незначительно отличаться друг от друга, от фото и от описания.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					5. Порядок доставки товара. <br> Территория доставки товара
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						5.1. Способы доставки Товара, реализуемого Продавцом, указаны на Сайте в разделе «Доставка и возврат». Конкретные сроки доставки могут быть дополнительно согласованы сторонами при подтверждении Заказа. <br>
						5.2. Территория доставки Товаров, представленных на Сайте и реализуемых Продавцом, ограничена странами Россия, Беларусь, Армения, Казахстан, Киргизия. Доставка в другие страны возможна в индивидуальном порядке по договоренности с Продавцом. <br>
						5.3. Стоимость доставки зависит от тарифов курьерских служб и веса Заказа, сообщается Покупателю индивидуально и осуществляется только по полной предоплате Заказа. <br>
						5.4. Товар вручается Покупателю либо третьему лицу, указанному в Заказе в качестве получателя (далее – «Получатель»). При невозможности получения Заказа, оплаченного посредством наличного расчета, Получателем, Заказ может быть вручен третьим лицам, которые предоставят сведения о Заказе (номер отправления и/или ФИО Получателя), а также могут оплатить стоимость Заказа в полном объеме лицу, осуществляющему доставку Заказа. <br>
						5.5. Во избежание случаев мошенничества, а также для выполнения взятых на себя обязательств, при вручении предоплаченного Заказа лицо, осуществляющее доставку Заказа, вправе затребовать документ, удостоверяющий личность Получателя, а также указать тип и номер предоставленного Получателем документа на квитанции к Заказу. Продавец гарантирует конфиденциальность и защиту персональных данных Получателя. <br>
						5.6. Риск случайной гибели или случайного повреждения Товара переходит к Покупателю с момента передачи ему Заказа и проставления Получателем Заказа подписи в документах, подтверждающих доставку Заказа. В случае недоставки Заказа Продавец возмещает Покупателю стоимость предоплаченного Покупателем Заказа в полном объеме после получения от службы доставки подтверждения утраты Заказа. Кроме стоимости доставки. <br>
						5.7. Обязанность Продавца передать Товар Покупателю считается исполненной в момент вручения Товара Получателю или после подтверждения получения Товара Получателем в заранее оговоренном месте выдачи Заказа (в том числе в пункте самовывоза). <br>
						5.8. При принятии Товара от курьера Получатель обязан осмотреть Товар и проверить его на соответствие Заказу, проверить срок службы Товара, целостность упаковки. <br>
						5.9. Время нахождения курьеров, доставляющих товар, реализуемый Продавцом, по адресу Получателя ограничено сроками сторонней курьерской службы. <br>
						5.10. Уточнить дату, время и при необходимости маршрут доставки, можно у Продавца. <br>
						5.11. Осуществление доставки – это отдельная услуга, не являющаяся неотъемлемой частью Товара, выполнение которой заканчивается в момент получения Получателем Товара. <br>
						5.12. Претензии к качеству приобретенного Товара, возникшие после получения и оплаты Товара, рассматриваются в соответствии с Законом РФ «О защите прав потребителей».
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					6. Оплата товара
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						6.1. Цена Товара указывается на Сайте в рублях Российской Федерации. <br>
						6.2. При неверном указании цены Товара на Сайте, Продавец информирует об этом Покупателя для подтверждения Заказа по исправленной цене либо аннулирования Заказа. При невозможности связаться с Покупателем данный Заказ считается аннулированным. Если оплаченный Заказ был аннулирован, то Продавец вернет Покупателю оплаченную сумму тем же способом, которым она была уплачена. <br>
						6.3. Цена Товара на Сайте может быть изменена Продавцом в одностороннем порядке. При этом цена на заказанный Покупателем Товар изменению не подлежит.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					7. Особенности оплаты с помощью банковских карт
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						7.1. В соответствии с положением ЦБ РФ «Об эмиссии банковских карт и об операциях, совершаемых с использованием платежных карт» № 266-П операции по банковским картам совершаются держателем карты либо уполномоченным им лицом. <br>
						7.2. Авторизация операций по банковским картам осуществляется банком. Если у банка есть основания полагать, что операция носит мошеннический характер, то банк вправе отказать в осуществлении данной операции. <br>
						7.3. Чтобы избежать неправомерного использования банковских карт при оплате Товара, Продавец проверяет Заказы, предоплаченные банковской картой. В целях проверки личности владельца и его правомочности на использование карты Продавец вправе потребовать от Покупателя предъявления документа, удостоверяющего личность. <br>
						7.4. Продавец вправе предоставлять скидки на Товар и устанавливать программу бонусов. Виды скидок, бонусов, порядок и условия начисления определяются Продавцом и указываются на Сайте.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					8. Возврат товара
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						8.1. Возврат Товара осуществляется в соответствии с законодательством Российской Федерации.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					9. Ответственность
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						9.1. Продавец не несет ответственности за ущерб, причиненный Покупателю вследствие ненадлежащего использования Товаров, приобретенных на Сайте.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					10. Заключительные положения
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						10.1. Продавец вправе переуступать либо каким-либо иным способом передавать свои права и обязанности, вытекающие из его отношений с Покупателем, третьим лицам. <br>
						10.2. Сайт и предоставляемые сервисы могут быть временно (частично или полностью) недоступны по причине проведения профилактических или иных работ, или по любым другим причинам технического характера. <br>
						10.3. В случае возникновения вопросов и претензий необходимо обратиться к Продавцу по телефону или иным доступным способом. Все возникающее споры разрешаются путем переговоров, а при недостижении соглашения спор рассматривается в суде согласно законодательству РФ. <br>
						10.4. Признание судом недействительности какого-либо положения Оферты не влечет за собой недействительность остальных положений.
					</p>
				</div>
			</div>

			<div class="grid xl:grid-cols-5 gap-3 xl:gap-16 mt-5 xl:mt-16">
				<div class="font-title text-xl xl:text-3xl xl:col-span-2">
					11. Реквизиты продавца
				</div>
				<div class="text-sm xl:col-span-3 grid gap-4 leading-6">
					<p>
						ИП ВАСИЛЬЕВ ИГОРЬ АЛЕКСАНДРОВИЧ <br>
						ИНН 470707713971 <br>
						ОГРНИП: 321470400013664 <br>
						ОКПО / Идентификационный номер ТОСП 2005762881
					</p>
				</div>
			</div>

		</div>

	</main><!-- #main -->
</section><!-- #primary -->

<?php
get_footer();
