<?php

/**
 * Template part for displaying the header content
 *
 * @link https://developer.wordpress.org/themes/basics/template-hierarchy/
 *
 * @package Нити_Света
 */

?>

<div class="mobile-menu hidden xl:hidden fixed z-[210] w-full h-full top-[60px] p-4 bg-[#F6F6F6]">
  <div class="mobile-menu-inner bg-white shadow px-3 py-8">
    <div class="flex flex-col gap-7">
      <a href="/shop" class="flex items-center h-14 w-full transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Изделия</span></a>

      <a href="/shop-books" class="flex items-center h-14 w-full transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Книги</span></a>
      <a href="/chinesetea" class="flex items-center h-14 w-full transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
        <span>
          Китайский чай
        </span>
      </a>
      <a href="/sweets" class="flex items-center h-14 w-full transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
        <span>
          Подарочные наборы
        </span>
      </a>
      

      <?php
      if (is_user_logged_in()) {
          // Код для авторизованных пользователей
          ?>
        <!-- HTML для авторизованных пользователей -->
        <a href="/profile" class="flex items-center h-14 w-full transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Мой
            профиль</span></a>
      <?php
      } else {
          // Код для неавторизованных пользователей
          ?>
        <!-- HTML для неавторизованных пользователей -->
        <!-- <a href="/loginregister" class="flex items-center h-14 w-full transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Вход/регистрация</span></a> -->
        <a href="#test-popup" class="open-popup-link flex items-center h-14 w-full transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Вход/регистрация</span></a>
      <?php
      }
?>
    </div>

    <div class="grid grid-cols-2 gap-x-4 gap-y-5 mt-6">
      <a target="_blank" class="group btn-border bg-[#F8F8F8] border-none" href="https://t.me/nitisveta">
        <svg class="mr-3 shrink-0" width="30" height="25" viewBox="0 0 30 25" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M1.83886 10.6406L19.7112 3.38849C21.4749 2.63306 27.4559 0.215701 27.4559 0.215701C27.4559 0.215701 30.2164 -0.841894 29.9864 1.72655C29.9097 2.78415 29.2963 6.48573 28.6828 10.4953L26.7658 22.3613C26.7658 22.3613 26.6125 24.0988 25.3089 24.4009C24.0053 24.7031 21.8583 23.3433 21.4749 23.0412C21.1682 22.8145 15.7239 19.4151 13.7302 17.7532C13.1934 17.2999 12.58 16.3934 13.8069 15.3358C16.5674 12.8429 19.8646 9.74568 21.8583 7.78157C22.7784 6.87506 23.6986 4.75987 19.8646 7.32832L9.0468 14.4932C9.0468 14.4932 7.81991 15.2487 5.51951 14.5688C3.21911 13.8889 0.5353 12.9824 0.5353 12.9824C0.5353 12.9824 -1.30502 11.8492 1.83886 10.6406Z" fill="#3B2F4A" class="group-hover:fill-white" />
        </svg>
        <span class="text-sm">Telegram</span>
      </a>
      <a target="_blank" class="group btn-border bg-[#F8F8F8] border-none" href="https://wa.me/+79650543710">
        <svg class="mr-3 shrink-0" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M0.41898 14.8675C0.417996 17.4473 1.09183 19.9657 2.37319 22.1854L0.295898 29.7699L8.05827 27.7346C10.1969 28.9008 12.6048 29.5155 15.0552 29.5165H15.0615C23.1311 29.5165 29.7004 22.9492 29.704 14.879C29.7053 10.9676 28.1833 7.28988 25.4191 4.523C22.6542 1.75644 18.9781 0.231866 15.0615 0.230225C6.99025 0.230225 0.421934 6.79624 0.418652 14.8671L0.41898 14.8675ZM5.04096 21.8031L4.75114 21.3429C3.53279 19.4057 2.88981 17.167 2.89047 14.8685C2.89342 8.16032 8.35268 2.70237 15.0657 2.70237C18.3167 2.70368 21.3718 3.97093 23.67 6.27043C25.9679 8.56993 27.2325 11.627 27.2315 14.8776C27.2285 21.5861 21.7689 27.0441 15.0611 27.0441H15.0562C12.8719 27.0427 10.73 26.4565 8.86208 25.3478L8.41734 25.0843L3.81079 26.2921L5.04096 21.8031ZM15.0615 29.5165C15.0611 29.5165 15.0611 29.5165 15.0615 29.5165V29.5165Z" fill="#3B2F4A" class="group-hover:fill-white" />
          <path d="M11.402 8.74738C11.1279 8.13821 10.8394 8.12574 10.5788 8.11523C10.3655 8.10604 10.1213 8.1067 9.87776 8.1067C9.63356 8.1067 9.2374 8.19827 8.90229 8.56424C8.56685 8.93053 7.62158 9.81541 7.62158 11.6154C7.62158 13.4156 8.93282 15.1549 9.11531 15.3994C9.29845 15.6433 11.6465 19.4552 15.3649 20.9217C18.4554 22.1403 19.0846 21.8981 19.7552 21.8371C20.4261 21.776 21.9198 20.9522 22.2247 20.0978C22.5296 19.2435 22.5296 18.5112 22.4384 18.3586C22.3468 18.206 22.1029 18.1144 21.737 17.9316C21.371 17.7485 19.5724 16.8636 19.2369 16.7415C18.9015 16.6194 18.6576 16.5587 18.4134 16.925C18.1696 17.2909 17.4688 18.1147 17.2555 18.3586C17.0421 18.6031 16.8284 18.6337 16.4628 18.4505C16.0968 18.267 14.9185 17.8811 13.5207 16.6348C12.4329 15.6649 11.6987 14.4676 11.4854 14.1013C11.272 13.7353 11.4627 13.5374 11.6459 13.3549C11.8103 13.1911 12.0118 12.9279 12.195 12.7142C12.3775 12.5006 12.4385 12.3479 12.5603 12.1041C12.6824 11.8599 12.6213 11.6462 12.5298 11.4631C12.4382 11.2799 11.7273 9.47078 11.402 8.74738Z" fill="#3B2F4A" class="group-hover:fill-white" />
        </svg>
        <span class="text-sm">WhatsApp</span>
      </a>
      <a target="_blank" class="group btn-border bg-[#F8F8F8] border-none" href="https://vk.com/nitisveta">
        <svg class="mr-3 shrink-0" width="31" height="18" viewBox="0 0 31 18" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M15.1674 17.9245H17.0203C17.0203 17.9245 17.5799 17.8617 17.866 17.5484C18.129 17.2605 18.1206 16.72 18.1206 16.72C18.1206 16.72 18.0843 14.1896 19.238 13.8169C20.3758 13.4496 21.8365 16.2625 23.3846 17.3442C24.5554 18.1625 25.445 17.9834 25.445 17.9834L29.585 17.9245C29.585 17.9245 31.7505 17.7885 30.7236 16.0555C30.6396 15.914 30.1254 14.7736 27.6454 12.4307C25.0493 9.9784 25.3973 10.3752 28.5243 6.13333C30.4286 3.55007 31.1898 1.97307 30.9519 1.29767C30.7253 0.654159 29.3245 0.824148 29.3245 0.824148L24.6633 0.853478C24.6633 0.853478 24.3175 0.805594 24.0614 0.961583C23.8109 1.11413 23.6501 1.47055 23.6501 1.47055C23.6501 1.47055 22.9121 3.46941 21.9285 5.16962C19.8529 8.75671 19.0229 8.94658 18.6836 8.72349C17.8943 8.2043 18.0915 6.63819 18.0915 5.52527C18.0915 2.04884 18.6096 0.599385 17.0826 0.22419C16.576 0.0997537 16.2028 0.0174257 14.907 0.0039823C13.2437 -0.0132387 11.8362 0.00920466 11.0392 0.406621C10.5088 0.670937 10.0997 1.25978 10.349 1.29367C10.6572 1.33545 11.3547 1.48532 11.7246 1.99751C12.2024 2.65913 12.1857 4.14436 12.1857 4.14436C12.1857 4.14436 12.4602 8.23663 11.5447 8.74482C10.9165 9.09346 10.0545 8.38173 8.20402 5.12729C7.25606 3.4603 6.54007 1.61743 6.54007 1.61743C6.54007 1.61743 6.4022 1.27312 6.15594 1.0888C5.85727 0.865478 5.43995 0.794706 5.43995 0.794706L1.01041 0.824148C1.01041 0.824148 0.345613 0.843035 0.10131 1.13735C-0.11603 1.39933 0.0839546 1.94051 0.0839546 1.94051C0.0839546 1.94051 3.55157 10.1979 7.47831 14.3592C11.0792 18.1749 15.1674 17.9245 15.1674 17.9245Z" fill="#3B2F4A" class="group-hover:fill-white" />
        </svg>
        <span class="text-sm">Вконтакте</span>
      </a>
      <a target="_blank" class="group btn-border bg-[#F8F8F8] border-none" href="https://vk.com/nitisveta">
        <svg class="mr-3 shrink-0" width="29" height="29" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M14.4999 0.000120163C6.49188 0.000120163 0 6.492 0 14.5001C0 20.643 3.82194 25.8943 9.21579 28.007C9.08909 26.8598 8.97451 25.0955 9.26607 23.843C9.52958 22.7114 10.9664 16.6356 10.9664 16.6356C10.9664 16.6356 10.5326 15.767 10.5326 14.4828C10.5326 12.4666 11.7013 10.9614 13.1564 10.9614C14.3934 10.9614 14.991 11.8901 14.991 13.0039C14.991 14.248 14.1989 16.108 13.7901 17.8317C13.4485 19.2749 14.5138 20.4518 15.9373 20.4518C18.5144 20.4518 20.4955 17.7345 20.4955 13.812C20.4955 10.3402 18.0008 7.91285 14.4387 7.91285C10.313 7.91285 7.89134 11.0074 7.89134 14.2054C7.89134 15.4517 8.37141 16.788 8.97047 17.5145C9.08897 17.658 9.10632 17.7838 9.07102 17.9304C8.96096 18.3883 8.71634 19.3732 8.66832 19.5748C8.60509 19.8402 8.45818 19.8965 8.18338 19.7686C6.37243 18.9257 5.24017 16.278 5.24017 14.1513C5.24017 9.57737 8.56349 5.37674 14.8209 5.37674C19.8509 5.37674 23.7598 8.96108 23.7598 13.7512C23.7598 18.7485 20.609 22.7702 16.2357 22.7702C14.7663 22.7702 13.385 22.0069 12.9122 21.1052C12.9122 21.1052 12.1851 23.8737 12.0089 24.5522C11.6815 25.8116 10.7978 27.3903 10.2067 28.3534C11.5634 28.7735 13.0052 29 14.4999 29C22.5081 29 29 22.5081 29 14.5001C29 6.492 22.5081 0.000120163 14.4999 0.000120163Z" fill="#3B2F4A" class="group-hover:fill-white" />
        </svg>

        <span class="text-sm">Pinterest</span>
      </a>
    </div>

  </div>

  <div class="text-xs text-center flex flex-col gap-3 mt-6 lg:text-left lg:mb-0">
    <a href="/publichnaya-oferta">Публичная оферта</a>
    <a href="/privacy-policy/">Политика обработки персональных данных</a>
    <a href="/dostavka-i-vozvrat/">Доставка и возврат</a>
    <a href="/about">О магазине Нити Света</a>
  </div>
</div>

<nav class="bg-white border-gray-200 fixed w-full z-50 top-0">

  <div class="container max-2xl:max-w-full flex flex-nowrap items-center justify-between mx-auto h-[60px] xl:h-[106px] py-2 xl:py-4">
    <a href="/" class="flex  items-center flex-shrink-0 mr-11">
      <img src="<?php echo get_template_directory_uri(); ?>/images/logo.svg" class="w-[175px] xl:w-[270px]" alt="Нити Света логотип" />
    </a>

    <button data-collapse-toggle="navbar-default" type="button" class="mm-button inline-flex items-center w-9 h-9 justify-center text-sm text-gray-500 rounded-lg xl:hidden hover:bg-gray-100 focus:outline-none focus:ring-2 focus:ring-gray-200 dark:text-gray-400 dark:hover:bg-gray-700 dark:focus:ring-gray-600" aria-controls="navbar-default" aria-expanded="false">
      <span class="sr-only">Open main menu</span>
      <svg class="mm-button-icon-hamburger" width="35" height="20" viewBox="0 0 35 20" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width="35" height="2.85714" rx="1.42857" fill="#EF3343" />
        <rect y="8.57129" width="35" height="2.85714" rx="1.42857" fill="#EF3343" />
        <rect y="17.1431" width="35" height="2.85714" rx="1.42857" fill="#EF3343" />
      </svg>

      <svg class="mm-button-icon-close hidden" width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect x="0.115234" y="25.3643" width="35" height="2.85714" rx="1.42857" transform="rotate(-45 0.115234 25.3643)" fill="#EF3343" />
        <rect x="2.50586" y="0.602539" width="35" height="2.85714" rx="1.42857" transform="rotate(45 2.50586 0.602539)" fill="#EF3343" />
      </svg>

    </button>

    <div class="hidden xl:flex xl:visible items-center gap-2 2xl:gap-4 w-full justify-between font-sans text-[#142346] 1.5xl:text-[16px] text-[15px]" id="navbar-header">
      <a href="/shop" class="flex items-center h-14 w-full max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Изделия</span></a>
      <a href="/shop-books" class="flex items-center h-14 w-full max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Книги</span></a>
      <a href="/chinesetea" class="flex items-center h-14 w-full max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
        <span>
          Китайский чай</span>
      </a>
      <a href="/sweets" class="flex items-center h-14 w-full max-w-[215px] transition justify-center rounded-[10px] 2xl:px-3 bg-[#F8F8F8] hover:bg-slate-100">
        <span class="">
          Подарочные наборы</span>
      </a>
      
      <a href="/wishlist" class="relative flex items-center h-14 w-full max-w-[60px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
        <div class="absolute left-4 top-4">
          <svg width="28" height="26" viewBox="0 0 28 26" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M25.3605 2.69808C24.6581 1.99548 23.8241 1.43815 22.9062 1.0579C21.9883 0.677647 21.0045 0.481934 20.0109 0.481934C19.0174 0.481934 18.0336 0.677647 17.1157 1.0579C16.1978 1.43815 15.3638 1.99548 14.6613 2.69808L13.9999 3.35953L13.3384 2.69808C12.6359 1.99548 11.8019 1.43815 10.884 1.0579C9.96614 0.677647 8.98233 0.481934 7.98879 0.481934C6.99525 0.481934 6.01144 0.677647 5.09355 1.0579C4.17566 1.43815 3.34166 1.99548 2.63918 2.69808C0.37095 4.96565 -0.0248231 8.45915 1.58184 12.0438C3.54018 16.4149 12.7121 24.8146 13.1014 25.1701C13.347 25.3941 13.6674 25.5184 13.9998 25.5184C14.3322 25.5184 14.6527 25.3941 14.8983 25.1701C15.2876 24.8146 24.4595 16.4149 26.4178 12.0431C28.0246 8.45915 27.6288 4.96565 25.3605 2.69808ZM23.9855 10.9526C22.6926 13.8367 16.9868 19.5535 13.9999 22.366C11.0129 19.5535 5.30846 13.8387 4.01418 10.9533C3.46991 9.7365 2.42824 6.67986 4.52459 4.5835C5.44336 3.66475 6.68946 3.1486 7.98878 3.1486C9.2881 3.1486 10.5342 3.66475 11.453 4.5835L13.0572 6.18767C13.181 6.31151 13.3279 6.40974 13.4897 6.47677C13.6514 6.54379 13.8248 6.57829 13.9999 6.57829C14.175 6.57829 14.3484 6.54379 14.5101 6.47677C14.6719 6.40974 14.8188 6.31151 14.9426 6.18767L16.5467 4.5835C17.4803 3.69306 18.7208 3.19629 20.0109 3.19629C21.301 3.19629 22.5416 3.69306 23.4751 4.5835C25.5715 6.67986 24.5298 9.7365 23.9855 10.9526Z" fill="#142346" />
          </svg>
          <div class="">
            <?php echo do_shortcode('[yith_wcwl_items_count]'); ?>
          </div>
        </div>

        <!-- <span class="relative left-3">Избранное</span> -->
      </a>

      <!-- <a href="<?php echo is_user_logged_in() ? '/cart' : '/cart?redirect_to=/checkout'; ?>" class="cart-button relative flex items-center h-14 w-full max-w-[60px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"> -->
      <a href="/cart" class="cart-button relative flex items-center h-14 w-full max-w-[60px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
        <div class="absolute left-4 top-4 ">
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M20.6665 24.6665C21.4012 24.6665 21.9998 25.2638 21.9998 25.9998C21.9998 26.7358 21.4012 27.3332 20.6665 27.3332C19.9305 27.3332 19.3332 26.7358 19.3332 25.9998C19.3332 25.2638 19.9305 24.6665 20.6665 24.6665ZM12.6665 24.6665C13.4012 24.6665 13.9998 25.2638 13.9998 25.9998C13.9998 26.7358 13.4012 27.3332 12.6665 27.3332C11.9305 27.3332 11.3332 26.7358 11.3332 25.9998C11.3332 25.2638 11.9305 24.6665 12.6665 24.6665ZM27.1852 5.27717L21.8585 15.9292C21.6332 16.3812 21.1705 16.6665 20.6665 16.6665H9.99984C9.2625 16.6665 8.6665 17.2638 8.6665 17.9998C8.6665 18.7358 9.2625 19.3332 9.99984 19.3332H23.3332C24.0678 19.3332 24.6665 19.9305 24.6665 20.6665C24.6665 21.4025 24.0678 21.9998 23.3332 21.9998C23.3332 21.9998 14.5505 21.9998 9.99984 21.9998C7.7905 21.9998 5.99984 20.2092 5.99984 17.9998C5.99984 16.3905 6.94919 15.0038 8.31852 14.3692L5.00785 3.33317H1.99984C1.26384 3.33317 0.666504 2.73584 0.666504 1.99984C0.666504 1.26384 1.26384 0.666504 1.99984 0.666504H5.99984C6.58784 0.666504 7.1065 1.05317 7.27584 1.61717L7.79187 3.33317H25.9838C26.0892 3.33184 26.1958 3.3425 26.2998 3.36784L26.3105 3.3705C26.4345 3.39984 26.5505 3.4465 26.6585 3.50784C26.8585 3.62117 27.0198 3.77984 27.1332 3.96517C27.2478 4.1505 27.3185 4.36517 27.3305 4.59584C27.3372 4.7185 27.3265 4.84384 27.2985 4.96784L27.2959 4.9785C27.2705 5.08384 27.2332 5.18384 27.1852 5.27717ZM23.8425 5.99984H8.59184L10.9919 13.9998H19.8425L23.8425 5.99984Z" fill="#142346" />
          </svg>

          <?php
    if (function_exists('WC')) {
        $cart_count = WC()->cart->get_cart_contents_count();
    }
?>


          <div id="your-element-id" class="cart-count <?php if ($cart_count == 0) : ?>hidden<?php endif; ?> flex items-center justify-center rounded-full bg-red-500 text-white absolute top-[-12px] right-[-12px] w-[24px] h-[24px] border-2 border-white text-center text-xs font-bold">
            <?php echo $cart_count; ?>
          </div>

        </div>

        <!-- <span class="relative left-3">Корзина</span> -->
      </a>

      <?php
      if (is_user_logged_in()) {
          // Код для авторизованных пользователей
          ?>
        <!-- HTML для авторизованных пользователей -->
        <!-- <a href="/profile" class="flex items-center h-14 w-full max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Мой
            профиль</span></a> -->
            <a href="/profile" class="flex items-center h-14 w-14 max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
              <svg width="27" height="26" viewBox="0 0 27 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M22.8567 19.4285H22.7496C20.1782 18.8928 17.821 18.2499 17.2853 16.9642C17.071 16.4285 17.071 15.6785 17.6067 14.8214C20.1782 9.89279 20.7139 5.71422 18.9996 2.9285C17.9282 1.10707 15.8924 0.0356445 13.4282 0.0356445C10.9639 0.0356445 8.92815 1.10707 7.85673 2.9285C6.14244 5.71422 6.67815 9.99993 9.35672 14.8214C9.7853 15.6785 9.89244 16.3214 9.67815 16.9642C9.0353 18.2499 6.67815 18.7856 4.21387 19.4285H3.99958C0.678153 20.1785 0.463867 21.8928 0.463867 24.5714V25.9642H1.96387H2.82101H24.0353H24.4639H26.3924V24.5714C26.3924 21.8928 26.1782 20.1785 22.8567 19.4285ZM11.7139 17.9285C12.1424 17.0714 12.3567 15.5714 11.3924 13.7499C9.24958 9.6785 8.60672 6.24993 9.89244 4.21422C10.5353 3.14279 11.9282 2.39279 13.4282 2.39279C14.9282 2.39279 16.321 3.03565 16.9639 4.10707C18.1424 6.14279 17.6067 9.6785 15.4639 13.7499C14.4996 15.6785 14.7139 17.0714 15.1424 17.9285C16.2139 20.2856 19.2139 20.9285 22.321 21.6785C23.7139 21.9999 24.0353 22.3214 24.1424 23.6071H2.82101C2.92815 22.3214 3.24958 21.9999 4.64244 21.6785C7.74958 20.9285 10.6424 20.2856 11.7139 17.9285Z" fill="#142346" />
              </svg>
            </a>
            <!-- <a href="/profile" class="flex items-center h-14 w-full max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Мой
            профиль</span></a> -->
      <?php
      } else {
          // Код для неавторизованных пользователей
          ?>
        <!-- HTML для неавторизованных пользователей -->
        <a href="#test-popup" class="open-popup-link flex items-center h-14 w-14 max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
          <svg width="27" height="26" viewBox="0 0 27 26" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M22.8567 19.4285H22.7496C20.1782 18.8928 17.821 18.2499 17.2853 16.9642C17.071 16.4285 17.071 15.6785 17.6067 14.8214C20.1782 9.89279 20.7139 5.71422 18.9996 2.9285C17.9282 1.10707 15.8924 0.0356445 13.4282 0.0356445C10.9639 0.0356445 8.92815 1.10707 7.85673 2.9285C6.14244 5.71422 6.67815 9.99993 9.35672 14.8214C9.7853 15.6785 9.89244 16.3214 9.67815 16.9642C9.0353 18.2499 6.67815 18.7856 4.21387 19.4285H3.99958C0.678153 20.1785 0.463867 21.8928 0.463867 24.5714V25.9642H1.96387H2.82101H24.0353H24.4639H26.3924V24.5714C26.3924 21.8928 26.1782 20.1785 22.8567 19.4285ZM11.7139 17.9285C12.1424 17.0714 12.3567 15.5714 11.3924 13.7499C9.24958 9.6785 8.60672 6.24993 9.89244 4.21422C10.5353 3.14279 11.9282 2.39279 13.4282 2.39279C14.9282 2.39279 16.321 3.03565 16.9639 4.10707C18.1424 6.14279 17.6067 9.6785 15.4639 13.7499C14.4996 15.6785 14.7139 17.0714 15.1424 17.9285C16.2139 20.2856 19.2139 20.9285 22.321 21.6785C23.7139 21.9999 24.0353 22.3214 24.1424 23.6071H2.82101C2.92815 22.3214 3.24958 21.9999 4.64244 21.6785C7.74958 20.9285 10.6424 20.2856 11.7139 17.9285Z" fill="#142346" />
          </svg>
        </a>
        <!-- <a href="#test-popup" class="open-popup-link flex items-center h-14 w-full max-w-[215px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100"><span>Вход/регистрация</span></a> -->
      <?php
      }
?>
    </div>
  </div>
</nav>

<nav class="lg:hidden bg-white border-gray-200 fixed w-full z-50 bottom-0 left-0 ">
  <div class="flex gap-5 h-[70px] items-center justify-between px-5">

    <a href="/wishlist" class="relative flex items-center h-[50px] w-[70px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">
      <div class="">
        <svg width="28" height="26" viewBox="0 0 28 26" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M25.3605 2.69808C24.6581 1.99548 23.8241 1.43815 22.9062 1.0579C21.9883 0.677647 21.0045 0.481934 20.0109 0.481934C19.0174 0.481934 18.0336 0.677647 17.1157 1.0579C16.1978 1.43815 15.3638 1.99548 14.6613 2.69808L13.9999 3.35953L13.3384 2.69808C12.6359 1.99548 11.8019 1.43815 10.884 1.0579C9.96614 0.677647 8.98233 0.481934 7.98879 0.481934C6.99525 0.481934 6.01144 0.677647 5.09355 1.0579C4.17566 1.43815 3.34166 1.99548 2.63918 2.69808C0.37095 4.96565 -0.0248231 8.45915 1.58184 12.0438C3.54018 16.4149 12.7121 24.8146 13.1014 25.1701C13.347 25.3941 13.6674 25.5184 13.9998 25.5184C14.3322 25.5184 14.6527 25.3941 14.8983 25.1701C15.2876 24.8146 24.4595 16.4149 26.4178 12.0431C28.0246 8.45915 27.6288 4.96565 25.3605 2.69808ZM23.9855 10.9526C22.6926 13.8367 16.9868 19.5535 13.9999 22.366C11.0129 19.5535 5.30846 13.8387 4.01418 10.9533C3.46991 9.7365 2.42824 6.67986 4.52459 4.5835C5.44336 3.66475 6.68946 3.1486 7.98878 3.1486C9.2881 3.1486 10.5342 3.66475 11.453 4.5835L13.0572 6.18767C13.181 6.31151 13.3279 6.40974 13.4897 6.47677C13.6514 6.54379 13.8248 6.57829 13.9999 6.57829C14.175 6.57829 14.3484 6.54379 14.5101 6.47677C14.6719 6.40974 14.8188 6.31151 14.9426 6.18767L16.5467 4.5835C17.4803 3.69306 18.7208 3.19629 20.0109 3.19629C21.301 3.19629 22.5416 3.69306 23.4751 4.5835C25.5715 6.67986 24.5298 9.7365 23.9855 10.9526Z" fill="#142346" />
        </svg>
        <div class="">
          <?php echo do_shortcode('[yith_wcwl_items_count]'); ?>
        </div>
      </div>
    </a>

    <a href="<?php echo is_user_logged_in() ? '/cart' : '/cart?redirect_to=/checkout'; ?>" class="cart-button relative flex items-center h-[50px] w-[70px] transition justify-center rounded-[10px] px-3 bg-[#F8F8F8] hover:bg-slate-100">

      <div class="">
        <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.6665 24.6665C21.4012 24.6665 21.9998 25.2638 21.9998 25.9998C21.9998 26.7358 21.4012 27.3332 20.6665 27.3332C19.9305 27.3332 19.3332 26.7358 19.3332 25.9998C19.3332 25.2638 19.9305 24.6665 20.6665 24.6665ZM12.6665 24.6665C13.4012 24.6665 13.9998 25.2638 13.9998 25.9998C13.9998 26.7358 13.4012 27.3332 12.6665 27.3332C11.9305 27.3332 11.3332 26.7358 11.3332 25.9998C11.3332 25.2638 11.9305 24.6665 12.6665 24.6665ZM27.1852 5.27717L21.8585 15.9292C21.6332 16.3812 21.1705 16.6665 20.6665 16.6665H9.99984C9.2625 16.6665 8.6665 17.2638 8.6665 17.9998C8.6665 18.7358 9.2625 19.3332 9.99984 19.3332H23.3332C24.0678 19.3332 24.6665 19.9305 24.6665 20.6665C24.6665 21.4025 24.0678 21.9998 23.3332 21.9998C23.3332 21.9998 14.5505 21.9998 9.99984 21.9998C7.7905 21.9998 5.99984 20.2092 5.99984 17.9998C5.99984 16.3905 6.94919 15.0038 8.31852 14.3692L5.00785 3.33317H1.99984C1.26384 3.33317 0.666504 2.73584 0.666504 1.99984C0.666504 1.26384 1.26384 0.666504 1.99984 0.666504H5.99984C6.58784 0.666504 7.1065 1.05317 7.27584 1.61717L7.79187 3.33317H25.9838C26.0892 3.33184 26.1958 3.3425 26.2998 3.36784L26.3105 3.3705C26.4345 3.39984 26.5505 3.4465 26.6585 3.50784C26.8585 3.62117 27.0198 3.77984 27.1332 3.96517C27.2478 4.1505 27.3185 4.36517 27.3305 4.59584C27.3372 4.7185 27.3265 4.84384 27.2985 4.96784L27.2959 4.9785C27.2705 5.08384 27.2332 5.18384 27.1852 5.27717ZM23.8425 5.99984H8.59184L10.9919 13.9998H19.8425L23.8425 5.99984Z" fill="#142346" />
        </svg>

        <?php
  if (function_exists('WC')) {
      $cart_count = WC()->cart->get_cart_contents_count();
  }
?>


        <div id="your-element-id" class="cart-count <?php if ($cart_count == 0) : ?>hidden<?php endif; ?> flex items-center justify-center rounded-full bg-red-500 text-white absolute top-[-12px] right-[-12px] w-[24px] h-[24px] border-2 border-white text-center text-xs font-bold">
          <?php echo $cart_count; ?>
        </div>

      </div>
    </a>

    <a href="<?php if (is_user_logged_in()) {
        echo "/profile";
    } else {
        echo "/loginregister";
    } ?>" class="h-[50px] w-[70px] flex items-center justify-center bg-[#F8F8F8] rounded-xl">
      <svg width="34" height="34" viewBox="0 0 34 34" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M25.9996 22.8002H25.8996C23.4996 22.3002 21.2996 21.7002 20.7996 20.5002C20.5996 20.0002 20.5996 19.3002 21.0996 18.5002C23.4996 13.9002 23.9996 10.0002 22.3996 7.4002C21.3996 5.7002 19.4996 4.7002 17.1996 4.7002C14.8996 4.7002 12.9996 5.7002 11.9996 7.4002C10.3996 10.0002 10.8996 14.0002 13.3996 18.5002C13.7996 19.3002 13.8996 19.9002 13.6996 20.5002C13.0996 21.7002 10.8996 22.2002 8.59961 22.8002H8.39961C5.29961 23.5002 5.09961 25.1002 5.09961 27.6002V28.9002H6.49961H7.29961H27.0996H27.4996H29.2996V27.6002C29.2996 25.1002 29.0996 23.5002 25.9996 22.8002ZM15.5996 21.4002C15.9996 20.6002 16.1996 19.2002 15.2996 17.5002C13.2996 13.7002 12.6996 10.5002 13.8996 8.6002C14.4996 7.6002 15.7996 6.9002 17.1996 6.9002C18.5996 6.9002 19.8996 7.5002 20.4996 8.5002C21.5996 10.4002 21.0996 13.7002 19.0996 17.5002C18.1996 19.3002 18.3996 20.6002 18.7996 21.4002C19.7996 23.6002 22.5996 24.2002 25.4996 24.9002C26.7996 25.2002 27.0996 25.5002 27.1996 26.7002H7.29961C7.39961 25.5002 7.69961 25.2002 8.99961 24.9002C11.8996 24.2002 14.5996 23.6002 15.5996 21.4002Z" fill="#142346" />
      </svg>
    </a>
  </div>


</nav>